{"posts":[{"title":"H在清华读硕的日子 day1","text":"今日开学了，上午学校里开了关于全球胜任力和心理健康的讲座，听完之后，先是感到全球化的重要性，全球化、领导能力，都是吸引H的关键词呀，加油干吧年轻人，以压力为动力！ 下午H和Y去打了篮球，许久未打，依然是曾经的感觉，只是体力不再是曾经的储备，夜晚看到清华校园里诸多跑步的同学，H也下定决心要恢复到自己的体力巅峰 傍晚，H和爸妈进行了今年的最后一次线下见面，匆忙接到电话，H买了几个印有清华图案的帆布袋，让爸妈回去给朋友们分了 晚上，H和Q通了会电话，Q房子旁着火了，还好趁着丢垃圾的间隔跑了出来，真是吓人，希望这是“大难不死，必有后福” 晚上H在宿舍看了会看天下，今日浏览的是关于大学生进入体制内的话题，大致是在讨论“躺平”与“内卷”，摘抄了几句H认为关键的话： 在企业，对员工的专业性要求更高；在体制内，对能力的要求则更为复杂 躺平后，失去的是锻炼自己的机会 离开了个人，系统和体制照样运转 总之，never躺平，努力成为所在系统或体制内关键的一员吧，持续锻炼自己！","link":"/2022/08/24/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day1/"},{"title":"H在清华读硕的日子 day0","text":"天气 晴 昨日，H与爸妈乘坐高铁抵达了北京，在清华南边的一家酒店住下，吃了一顿北京烤鸭后，便睡觉了 今天一大早，三点四十便起身，四点搭上出租车，前往天安门观看升国旗，天色很美，升国旗很庄严，心情很愉悦 看完升国旗，简单地游览了一下天安门广场，看了天安门城楼、人民英雄纪念碑、人民大会堂、国家博物馆…… 吃了早餐过后，又驱车前往景山，登上景山，俯瞰故宫，开阔之势，令人心胸与气概都打开了几番 下午H进清华报到了，简单地道别过后，便一个人踏上了接下来的旅程，陪伴他的人将会有谁，前进的道路能走成什么样，让我们拭目以待","link":"/2022/08/23/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day0/"},{"title":"H在清华读硕的日子 day11","text":"今天是周六，是H略微颓废的一天，早上看了下瑞·达利欧的关于成功的视频，大概是讲radical truthfulness and transparency，即人与人之间需要足够的信任以及充分表达各自的观点，通过这种idea的碰撞来让团队获得一个综合的更优解。 今天H略感颓废，最近虽然看了很多成功学案例，也在心里默默埋下了很多想要实现的种子，但是由于腿伤，一直振作不起来，整天待在宿舍里边，十分的想念外面的世界，希望腿赶紧好起来吧。","link":"/2022/09/03/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day11/"},{"title":"H在清华读硕的日子 day12","text":"今天学校开展了研究生的消防演习，H因为腿上的原因还是只能在宿舍里面躺着，说实话如果真的发生了火灾，拖着条病退的H还真不知道能不能安全地逃出去呢。 下午突然狂风四起，北京跟刮龙卷风一样，呼呼的风声在宿舍听得一清二楚，倾盆大雨瞬间从天上泻下。 晚上H撑着拐出去走了走，做了个核酸，经过一周的撑拐生活，H对拐杖的运用是更加得心应手了，可以自如地上下楼梯啦，下完雨的北京十分的清爽，要是没有脚伤，H一定要骑着自行车在清华园里好好游览。 晚上H和舍友探讨未来一定要成为资本家，打工是没有前途的，看来未来还是要想点广一点的出路，H也要成为能够财富自由且随心所欲生活的人。","link":"/2022/09/04/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day12/"},{"title":"H在清华读硕的日子 day10","text":"今天早上去体检了，H稀里糊涂地将验血的条形码贴到尿管去了，结果去验血的时候只剩一个验尿的条形码，真是个憨憨呀。提交完验尿的尿管和抽完血后，H在医院准备复查脚踝的伤势，医生给拍了个CT，本以为要两个小时才能出结果，遂到旁边的近春园边的椅子坐下，景色是十分的美丽，H真想快快好起来，将清华园逛个遍。 今天早上学校开展了关于研究生阶段学习的讲座，演讲的是个老外，H非常欣赏其中的一句话，”graduate study is like climbing a 200-300m hill, but research is like climbing a huge mountain, only when you stand at the very top of the mountain, can you see the wonderful scene.” 当然原话可能不是完全相同，但大概意思也相近，在过往的学习经历中，H其实更多算是一个”做题家“风格的学生，对于做题，只要量够，大多都能拿下，然而对于research，还是缺乏了一定的持之以恒的信念，最近脚伤的日子在宿舍也是时常”摸鱼“，该提醒自己多多干活了！ H今天读了《看天下》中关于婚姻爱情的一些文章，其中谈到了当今社会中离婚的情况在年轻人中逐渐增多，也有学者将这种现象称为社会爱情观的进步，是性别平等、爱情自由的进步体现。真正的爱情应该是什么样子，H好像也不太清楚。改天H打算调查一下当下社会中离婚的一些数据，先立个flag，希望不要又只是想想而已。","link":"/2022/09/02/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day10/"},{"title":"H在清华读硕的日子 day13","text":"H从早上到下午都忙着下午的组会，今天仍然是效率一般的一天，似乎还没有找到研究生的学习与工作的节奏，当然一部分原因在于他的脚伤了，整天待在小小的宿舍之中总是令人难受的，现在的H非常同情疫情期间关在家里不能出来的人们，关着真的是会憋坏人的啊。 开组会的时候老师又开始画饼了，希望大家能做出实用的商用级别的软件，H现在正在负责的是防护勒索软件中的一个部件，能做成商用级别的软件H当然是非常憧憬的，但是事实应该是很困难的，希望H能尽力做好工作吧，做出点成绩，像众多伟大的学者一样！ 今天H的杂志到货了，到了几本新的看天下以及半月谈，接下来的日子不要整天再沉迷于b站了。","link":"/2022/09/05/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day13/"},{"title":"H在清华读硕的日子 day15","text":"下午学院开了关于开源软件生态的讲座，著名的IoTDB的D老师为大家介绍了开源相关的生态以及IoTDB的发展历程，很厉害，是国内为数不多的apache项目，H也想以后能够建造出这么伟大的作品，让千千万万的人都用上自己的作品。 今天是H和Q在一起的最后一天，虽然之前已经拖过了一次，但这一天还是来了，七年的时光啊，真的一晃而过了。Q给H寄了一盒月饼，H也给Q买了哈根达斯的月饼券，就当是在一起的最后的礼物吧。今天，H和Q约定了分手的五条理由： H总是说到没做到 H总是喜欢甩锅 H总是拒绝和Q沟通 H总是不经意间拆Q的台 H和Q性格三观不合 对于这一天的到来，H已经想了很久，但还是阻挡不了，Q的心意似乎已决，Q对H已经没有喜欢的情感了，H觉得也没必要纠缠了，尽力看淡过去的日子吧，只能怪曾经的自己不给力，现在回想起来，整个大学四年，确实没有做到一个合格男友应该做的，H应该深刻地反思自己作为一个男生应该担负起的角色与责任，希望未来更好。 Q不是H喜欢的第一个女生，但是是和H在一起时间最长的一位女生，或许直到H结婚，都难以再找到和Q在一起那么长时间的女生了。回顾过去的几年，Q一直是一位体贴、善良而又可爱女友，H和Q一起有过许多珍贵的记忆，他们一起去看过很多场电影，一起吃过很多顿大餐，一起去旅过游，一起排练与演出，一起参加比赛，一起赶ddl，一起准备高考，一起去图书馆，曾经不知道多少次，H和Q看起来是多么得有缘，H很难受。 H希望Q的未来安好，H也会变得更好，或许在下一个十字路口H和Q还能继续相遇。","link":"/2022/09/07/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day15/"},{"title":"H在清华读硕的日子 day14","text":"今天是H比较认真工作的一天，白天完成了一个库的编译，可以运用到自己的代码里面了，这周的工作算是有了一定的希望，接下来几天要朝着完善备份工具继续前进。 下午学院请了在快手工作的学长回来举办讲座，讲了关于职业规划以及元宇宙的一些概念，H大概从中了解了这几十年来的一些赚钱的风口，当今国家面临的卡脖子问题，以及ai+计算机图形学在当今的一些应用。很多时候H总是在想是不是当时选个ai相关的方向来读研会更好一些，期间也总是用现在的研究方向很重要来然自己的心里好接受些，不过嘛，各有各的重要之处，系统的安全无论在任何时候都是离不开的话题，所以H还是认为现在所选择的系统安全方向是可以接受的，更何况，“三百六十行，行行出状元”，把现在的事情做好吧，以后总是会有很好的机会的。","link":"/2022/09/06/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day14/"},{"title":"H在清华读硕的日子 day16","text":"今天H很颓废，白天很早就被阳光亮醒了，不知道是窗外的阳光确实分外的耀眼，还是因为内心的阴暗一遇见阳光便显得格外的敏感。起床后，H如往常般等待着手机的那声震动，期待着Q的消息，不过从此以往是等不到了，结束了，H想了想，从有记忆以来，Q竟占据了H几乎一半的时光，上天呐，这种感情，就算其中有矛盾，但是H根本无法轻易地放下，H开始自暴自弃，玩了一天的WZRY，没上什么分，在一盘盘二十分钟的游戏中，通过机械的操作来打发掉了时间。H很想发泄一下心情，但是怎么才能做到呢，H从来都是一个把心情憋在心里的人，恐怕只能由时间来慢慢抹去这记忆吧。 下午学院开了关于“软件的品质”的讲座，大致讲了一些新时代应当对软件的新理解，不过H今天的心情很复杂，没怎么听进去。 晚上H收到了很多月饼快递，有双黄莲蓉，有奶黄流心，有别人自己做的什锦月饼，Q送的鸡羊猪牛月饼也到了，不过还没来得及去拿，明天去收回来吧，毕竟也是Q作为H的女朋友送的最后的礼物了。 晚上H还收到了不好的消息，H的父亲住院了，不过应该不是什么大的问题，H突然很懊悔为什么当初没有早点出去工作为家里分担负担，现在H决定，读完硕后便要出来工作，为家里分担负担，尽一个儿子应该尽的责任。","link":"/2022/09/08/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day16/"},{"title":"H在清华读硕的日子 day18","text":"今天是教师节与中秋节，H祝所有的老师们教师节快乐以及所有的人中秋节快乐，阖家团圆。 今天H的脚基本上恢复了，加上刚买好了自行车，白天把宿舍之前屯的垃圾扔掉后，就骑着车出去稍微转了转，去院楼拿了鼠标和支架回宿舍用，本来买了个罗技G304觉得是个高端鼠标，不过用起来有点吵，不知道在宿舍用或者在实验室用会不会吵到大家呢。 中午去了桃李园吃了饭，终于是可以自如地去饭堂堂食了，去了之后真是震惊，所有菜基本上都是4-6块，而且超级大份，还可以双拼，这样一份才花了13块钱，简直不要太划算。 下午H给了一些月饼给亲戚Y和高中同学N，在宿舍楼底下和N浅谈了一会，N是生物方面的直博，他们第一年实行轮转制，需要在三个实验室轮流实习，然后再确定导师，这听着虽然不错，不过也难免会有些“卷”呢，这博一估计要跟高三差不多卷了。 晚上H和舍友以及Y的同学去吃了高兴火锅，低配版海底捞。回去后H和IoTDB的同学们玩了会狼人杀，不过第一盘体验一般，预言家悲催的死太早了，玩了一盘后天公不作美，就速速回了。操场上人是真的多呢，不能不说，清华人，确实是会学又会玩的一批人。 今夜的月亮很圆，不过拍不出来，只有在东南门上粗略的拍的一张。 这是第一个没有Q的中秋，Q今天也回学校了，回去后被关了好久才能够从宿舍出来活动，在没有任何用品的床板上躺了一会，真是悲催。这么多行李，也不知道Q好不好运回宿舍。今天Q来找H吐槽了一下宿舍，问了一些关于宿舍网络的使用问题，仅此。 没有Q的中秋，月圆，人难圆。","link":"/2022/09/11/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day18/"},{"title":"H在清华读硕的日子 day2","text":"今天早上照例是听了三场清华的讲座，分别是关于如何顺利度过读研阶段、研究生英语学习、研究生培养基本要求与资源，线上的讲座照旧是缺了点吸引力，H半开小差半听得过完了这个上午，随手摘抄几句，或许对未来有点作用 今日H和Q打了电话，Q不喜欢别人和她开玩笑，不能随便说Q的坏话 今天H照例看了会看天下，今日所涉及的议题是斯里兰卡，曾经的旅游胜地变成一个群众冲进总统府旅游的不堪国家，可谓是令人唏嘘，导致其直接崩溃的原因或许是疫情影响的旅游业的低迷，不过究其内在的原因，大致可有以下几点： 腐败、独裁、任人唯亲、将国家政治建立为家族企业 挤压、排斥少数民族 错误的经济决策 引用文章中的话： 首先，斯里兰卡经济结构一直存在问题，外加疫情带来的旅游收入断崖式下降，外汇短缺造成的物资短缺和通货膨胀，以及不合时宜的减税措施和过分激进的去化肥政策，经济崩溃已然不可避免。 其次，该国政治阶层长期独大并滥用权力，政府内部早已失去了纠错能力，任由错误决策频频发生。 统治阶层独裁，专用家庭成员导致国家灭亡的事情，在中国的历史中似乎并不少见，不得不感叹，如果他们的统治者能多了解点中国的历史，吸取吸取教训，恐怕国家也不至于此吧 晚上，H第一次去清华的操场跑步，不过因前几日搬家、打球似乎弄得腰不太行，得花时间恢复恢复。","link":"/2022/08/25/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day2/"},{"title":"H在清华读硕的日子 day17","text":"2022真是个魔幻的年份，今天英国女王去世了，查尔斯王子准备接替英国女王成为英国的国王，跨时代的人物啊，终究还是融入了历史长流中，英国女王是如此，我们每个普通人又何尝不是如此呢。 2022对H来说也是个艰难的年份，原本好好的毕业季成了Q离开的季节，H的父亲也因病住院，H刚开学打了第二场篮球就脚踝大伤，真的有那么玄学吗，怎么会这样呢，什么时候才能转运呢？ 今天H的心情稍微平复了，因为Q来找H说了些话，谈及了一些H之前送给Q的哈根达斯月饼，可惜Q的日程安排得太紧密了，没有时间去拿，H只能让弟弟去拿了回来，样子还是很可爱的： 没关系，月饼没送到，那就之后再送个鼠标吧，月饼一口而尽，鼠标长存掌心。 下周就要开学了，H的腿还是只能一瘸一拐地走，为了能够方便地上学，H在校内买了一辆单车，花了五百多块钱，不知道有没有被坑，不过这是H第一次买这种山地车，骑着感觉也挺好的，买好后，H立马骑上它在校园里面转了转，去了之前没去过的地方，不过因为时间晚了，也没游历到太多的景点，留着以后再去吧。 今天H也终于再次在清华的食堂堂食了，今天去清芬吃了个番茄鸡蛋刀削面，花了８块钱，终于不用再吃盒饭了ｈｈ，感觉十分不错，以后也可以出去吃早餐了，H也要把健身饮食计划摆上日程了，争取将体重降到１２０吧，定个小目标。 H希望世间的苦难赶紧消退，愿快乐降临在每个人的身上。","link":"/2022/09/09/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day17/"},{"title":"H在清华读硕的日子 day19","text":"早上H去丁香园饭堂吃了肠粉，虽然口感还是不及家那边的，不过能在外吃到家乡的美食确是一件美事，下次要去别的饭堂探索一下有没有更好吃的肠粉。 上午H去练了小提琴，很久没练了，今天去了蒙民伟楼的艺教中心的琴房，说实话，一进去，真的有一种艺术的氛围，进入这里感觉便是一种享受。 这次H订的是小琴房，5块钱，没到时间也可以开始进去练，里面设施很齐全，很干净整洁，有几个谱架几张凳子，有空调有灯光，环境很好，H练了练音阶，还有莫三和巴赫无伴奏，虽然状态还没恢复，不过还是很享受。虽然一个人练琴声音很干净，但是H仍然怀念与Q在一个琴房拉琴的日子。最近H看了ｔｗｏｓｅｔ的视频，又听了门小协，很入迷。 晚上１８级的南大同学组织了聚会，H和舍友Y都去了，吃了紫荆负一层的披萨，认识了很多大佬，大家都很见多识广并且爱好特长颇多，H也要向大家好好学习呢。吃过晚饭后，大家一起紫荆操场玩了玩，玩了一夜狼，挺过瘾的，H很快乐。中秋马上要过去了，开学前的快乐日子也要结束了，接下来还是要努力，把未来三年过得成功又精彩！","link":"/2022/09/11/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day19/"},{"title":"H在清华读硕的日子 day20","text":"今天是中秋假期的最后一天，也是正式开学前的最后一天了，H的腿恢复的不错，现在已经基本上可以正常行走了，早上也可以去饭堂吃到新鲜的早餐而不是啃面包了。肉包子只用0.35元一个，不过比较小，味道一般，皮蛋瘦肉粥倒是感觉不错。 下午H去参加了班级迎新晚会的彩排，大家合唱了平凡之路，还行，虽然一开始大家唱的有点零零散散，不过后面表演的时候效果还是很不错呢。晚上的迎新晚会，有很多游戏，H只参加了一个叫做“反口令”的游戏，挺有意思的，希望以后能多点机会结交更多的朋友。 今天乐团发招新的通知了，H很激动，H特别想去清华的乐团体验一下超一流乐团的氛围，H立马预约了两场琴房，准备在考核前大大地练习。今天在迎新晚会上H看到W同学演奏小提琴渔舟唱晚，那技术简直是让H太羡慕了，从琴的声音，到强弱变化、揉弦都非常厉害，后来一问是清华的特长生，H心里放松了点，不然H还以为清华里面到处都是卧虎藏龙呢，H也希望能够变得这么厉害，能够在众人面前solo而不怯场。 明天要开学了，H要开始好好学习工作了！","link":"/2022/09/12/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day20/"},{"title":"H在清华读硕的日子 day21","text":"今天是开学的第一天，H有早八，早上的人是真多呀，饭堂排队人多，路上单车多，一路赶着总算是没迟到，第一节课是在二教上的，教室配置很好，桌上有人手的插座，不愧是清华呢。 第一节课H上了工程硕士数学，实为数值分析方法，做了一些导论，还没涉及到硬核的知识。 第二节课从二教赶到了东阶去上课，老师是软院知名的S老师，科研水平非常高，课也讲的很好，人很有激情，H觉得这节课没选错。 下午H去健身房，花了1500开了两年卡，开始第一天复健，今天练了练胸，做了卧推了夹胸，身体机能还有待恢复到最佳水平。 晚饭H在清芬解决，吃了二楼的烤鸭，味道挺不错的！ 晚上H上了老板Y老师的领域特定语言建模，Y老师很有趣，虽然基本上只记得Y老师在美国把价值4000-4500刀的车撞成了40刀了。","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day21/"},{"title":"H在清华读硕的日子 day22-23","text":"这两天清华的艺术团开始招新了，中午在紫荆的门口摆摊，有交响乐团、军乐团、合唱团等等，军乐团的路演还是挺不错的，都吹得很好，确实有军乐团那种气势。H报名了学校的交响乐团，周三中午吃完饭去乐团的路演看了下，没等到开始就回去了，周四去面试了交响乐团，考了一首独奏、音阶还有一段视奏。H的独奏选了莫扎特三号，拉的时候有点紧张，感觉没发挥出平常练习的水准，不过考试嘛，紧张也正常；音阶就简单选了独奏对应的G大调，最简单的一个，也还算顺利地拉完了；最后的视奏环节，考官给了一段德九，德九呀，这不就是本科期间排过的曲子吗！可惜H虽然对旋律还算熟悉，但是由于是一提声部的谱子，所以拉起来磕磕绊绊，许多音找不到，拉到后面节奏也有点崩了，还是太紧张了啊！视奏的练习机会还是太少了，H还要加强这方面的能力。这周末就会出结果了，H希望自己能进到清华交响的小提声部！ 这两天H看了一些文章，一篇是36氪发的一个关于科技股泡沫的文章（纳斯达克史诗级崩盘，科技股泡沫破裂还是周期终结？丨氪金 (qq.com)），觉得写的不错，将链接附上，H觉得写得很贴合现实。这篇文章大致讲了互联网科技的泡沫。互联网的泡沫其实从给程序员的高额工资中就可瞥见端倪，互联网企业真的给社会带来了巨大的生产力的提升吗？ 除此之外，H今天还阅读了《看天下》中关于芯片的讲解，美国想要与日本、韩国以及中国台湾成立芯片联盟ｃｈｉｐ４，从而遏制中国芯片技术的发展以及应用。文章介绍了美、日、韩三国的芯片行业的发展历程，以及中国台湾台积电企业的发展史。通过他们的历史，H认识到，必须要做实业的企业才有稳固的根基，且企业一定要有长远的眼光，能够在经济的低谷期看到未来的发展趋势，不应盲从时代，而应选择做真正正确的事。 晚上H第一次去了清华的图书馆，去的是李文正馆，H觉得这个馆的设计很庄严，很有学习的氛围，而且里面的座位设置，看起来与国外的大学类似，H觉得很有感觉。H还发现清华的图书馆内竟然还有音乐馆，在里面可以听耳机，挺不错的，以后可以多多去玩玩呢。","link":"/2022/09/15/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day22-23/"},{"title":"H在清华读硕的日子 day21","text":"H今天又是早上满课，早八上了英语，感觉老师的口语讲得一般，不过课程设计得还算有趣，H还是希望后面要好好学学英语，最好是能考个托福或者啥的，当然更重要的是要锻炼好读论文、写论文和汇报论文的能力。 接着H上了《自动机与形式逻辑》，H觉得这门课还是很有趣的，涉及很多数学的推导，然而一共只有7个人选修了这门课，H觉得挺奇怪的，也在怀疑究竟是老师的问题还是课程本身的问题，不过到了研究生阶段，H还是想选修一些自己觉得有意思的课程，就先上着吧，应该是会有收获的。 晚上H第一次去了清华的泳池，长度是50m的，深度有1.2m，1.3m，还有深水区不知道多少米的，或许是周五的原因，人有点多呢，没能游得很快，不过刚开始复健也别游得太快了，慢慢恢复起来吧，降低体重，修建好身材！ 今天H看了《看天下》，觉得里边有比较不错的话，来自薛兆丰，“世界上最稳定的工作，是你对别人有贡献的工作，世界上最稳定的供给，是让别人有钱赚的供给。”结合一下之前看的瑞·达利欧的视频，经济系统是一个所有人相互交互的系统，“一个人的支出是另一个人的收入”，只有大家的财富都能够共同生长，社会才会更加稳定前进。","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day24/"},{"title":"H在清华读硕的日子 day25","text":"早上H去了图书馆，将自动机的作业写了，重新回顾了一下latex的基本语法，忘得差不多了，需要重新拾起来！ 延续着昨天的激情，H今天又看了一部诺兰的科幻片，《盗梦空间》，剧情非常玄幻，看了一遍感觉没怎么看懂，大概是一个循环梦中梦的故事，有点类似小时候听到的，“从前有座山，山里有座庙，庙里有个和尚，和尚在讲故事，从前有座山，。。。”，是个无限递归的套娃故事。里面关于梦和现实的混淆，也与我国古代的哲学有些许相似，究竟梦境和现实，哪个才是真的呢？","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day26/"},{"title":"H在清华读硕的日子 day25","text":"这两天H又回顾了星际穿越这部电影，不得不说是真的好看呀，H觉得有以下几个点是最吸引他的： 科幻元素 主角的牺牲精神 延续种族的话题 今天乐团的考核出结果了，H只录取到了二队，H的心情非常低迷，感觉最近真是坏事成对出现，晚上在党支部竞选副党支部书记也没选上，什么时候才能结束这悲惨的日子呢。","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day25/"},{"title":"H在清华读硕的日子 day25","text":"今天H同团长申请了加入中提琴声部，团长说可以过几天先去试一下，说不定H可以通过这样进入清华交响的一队，参加更多的排练与演出。H这几天想了想觉得拉中提也不错，一来H的小提琴技术碍于基本功的训练可能已经难有提高，二来学了中提相当于多会了一门乐器，并且以后在排重奏的时候可以更容易地组队啦。希望中提声部还有空位能够接纳H，H最近的周末确实过得比较颓废，需要一些事情来打发打发时间。 今天H上了两门课，下午听了X老师的信息可视化与可视分析，展示了一些很炫酷的图表，H很佩服那些设计者的创造力，能够将抽象的数据展示得如此清晰直观，兼具美学特点。晚上听了B老师的应用密码学，B老师的节奏很快，课程讲得很有条理，中间穿插了许多故事，还有很多神奇的数学公式，是门硬核课，H觉得以后上这个课或许得先预习一下呢。 晚上H去了游泳，游完泳Q来找H聊了一下未来工作的事情，今天H在朋友圈看到南大的H同学进入虾皮公司仅43天就被裁掉了，H不禁感叹互联网行业的兴衰是如此之快，与此同时H也开始担忧起自己的未来，这不是某个行业的衰退，而是整个社会经济处于下行的表现，每个身在其中的人都无法避免，要想扭转这一切，一定要加速经济周期的运行，想办法提高社会的生产力吧，H也要在这三年间做出些有意义的事情来啊。","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day27/"},{"title":"H在清华读硕的日子 day30","text":"今天是忙碌的一天，今天H做完了明天英语课的阅读报告、完成了清研爱劳动的问卷填报，做了核酸检测志愿者，开了明天集体建设大会的志愿者安排会议，非常充实的一天呢。 晚上北京刮大风，天气很冷，H感觉已经是广州的冬天的感觉了。 今天H看了《看天下》中关于英国女王伊丽莎白二世的一些历史故事，以及王室中的一些其他成员的故事，明天准备继续了解一下伊丽莎白二世去世对英国王室以及英国乃至世界的影响。","link":"/2022/09/22/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day30/"},{"title":"H在清华读硕的日子 day25","text":"今天早上全部是课，H对待这些课程的激情已经不如前一周了，一方面是课程的难度提升了，工程硕士数学开始讲各种矩阵变换来解方程组，深度学习开始深入MLP的原理；另一方面是H的生活习惯也还没调整过来，前一周尚可以通过激情来让自己的身体充满能量，这周就已经有点犯困了。当然也可能和昨晚太晚去游泳有关系，以后还是早点运动，别卡在很晚的时间去。 晚上上了Y老师的课，H觉得Y老师备课有点随意，从ppt上的图片都是糊的可见一斑，虽然Y老师确实是一个很亲民的老师，但是H认为对待上课这件事情还需花多点心思，否则就是学生与老师共同在此虚度两个半小时的光阴了。","link":"/2022/09/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day28/"},{"title":"H在清华读硕的日子 day29","text":"昨天晚上H失眠了，并且早上为了开组会，早早地前往实验室，然而组会一直到11点才开始，开完会还和实验室的同学以及Y老师一起去吃了饭。 吃完饭就马不停蹄地去上课了，H下午唯一一节13：30的课是新中国特色社会主义，D老师是马院的院长，课程安排还行，古今中外都会涉及到，唯一的缺点是课程节奏太慢了，对于这个时间点的课来说实在是有点催眠。 晚上H也精神状态不佳，身体疲惫得也不想做什么运动，便骑上自行车在校内转了转，不过夜晚的清华并没有太多美丽的景色，H希望等到周末有空的时候骑着车到外面去转转，疏解一下紧张的生活状态。","link":"/2022/09/21/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day29/"},{"title":"H在清华读硕的日子 day3","text":"今天是H初入实验室的日子，早早地，便与学长共同用完早餐然后前往实验室，获得的工位在进门的第二个，虽然显示屏容易暴露在大众眼光下，不过也还能接受，毕竟在实验室还是要认真工作的，这样反倒是起到了一点监督的效果。 下午组会了，见到了之间一直带着H做课题的J学长，J学长人很好，而且和H是半个老乡，这样的关系也是挺好的。接着，课题组开会了，第一次线下见到了许多面孔，包括Y老师，大家都是很优秀很随和的人，H看到了未来三年在这里成长的美好希望。 组会完了后，H和师兄一起去打篮球了，过程很快乐，奈何天有不测风云，在一次抢板落地时不慎踩到他人的脚而重重地扭伤了，这次情况似乎不同于以往，这次倒地后是那种撕心裂肺的痛，腿一直在抖，起来后脚也完全无法支撑在地面，H似乎意识到了情况不太对，简单地冰敷过后，前往了校医院，拍了片，以为是骨折，即刻转往北医三院，继续拍片，所幸，经确认后并未发现骨折迹象，情况得到缓和，但免不了的是用起了支架，且要面临一段时间与各球类运动甚至是出宿舍楼无缘了，好好养病吧，千万别留下后遗症。特别感谢X, Z, H师兄的关照，否则估计今天应该是出不去篮球场了。 不要伤心，不要气馁，“天将降大任于斯人也，必先劳其筋骨，饿其体肤”，保持乐观的态度恢复！","link":"/2022/08/27/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day3/"},{"title":"H在清华读硕的日子 day32","text":"今天H去练了琴，感觉中提琴还是非常难呐，主要是有两重转换，需要从中音谱号先转到高音谱号，然后再转换到中提琴的指法上，真是太难了呀，感觉明天的排练很慌，中途有一个在隔壁琴房练琴的C同学还来照顾指导了两下，非常热心，后来还知道C同学也是从南京东大来的，真是非常巧合。 晚上H去听了清华山野协会的宣讲，感觉这是一个非常震撼的社团，今天在新水楼405宣讲，本来群里有500个人满了，不过到线下的也只有20-30个人，虽然人少了点，不过观感就有所提升嘛。社团让H最震撼的是会去进行野攀和爬雪山，H也很想一睹在山的顶峰的样子，希望后面能跟着社团一起去参加些活动。 今天H看了《看天下》中的关于英国女王的故事。一方面，了解了女王70年来的一些经历，了解了她的家庭，了解了王室的绯闻故事等等；另一方面，也了解到作为女王伊丽莎白二世受到的种种拘束。杂志中这样写到，“大部分人都会羡慕王冠之下豪华的宫殿与优渥的生活，但罕有人会去挖掘，王冠其实代表着一个封闭而传统的系统。在这个系统中，人性被压制，拥抱与情感流露都是稀缺物。“这或许就是这种封建主义最大的弊端吧，封建主义中，人们将”王“与”神“同等看待，认为”王“是在现实世界中”神“的代表，所以以”神“的要求来要求”王“，以此来满足自己内心对”神“的认识。但是这种想法从根本上就是不对的，”神“可以作为心里对美的想法，但是不应当具象到某个人身上，人是有七情六欲的动物，以压抑他人的本性来换取自己内心的满足，未免过于自私了。不过不得不说，伊丽莎白二世这个现实世界中的”神“，为英联邦的团结做出了巨大的贡献，只不过不知道她逝世后是否还能维持住了。 马上H的弟弟T要参加成年礼了，H要给T准备点礼物了。","link":"/2022/09/24/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day32/"},{"title":"H在清华读硕的日子 day33","text":"今天中午H和以前W老师的弟子们吃了冯三娘翘脚牛肉，正好去到就有位置，运气真不错呢。大家聊了聊当下的专业，曾经关于W老师的故事等等，能和这些优秀的同学在一起还是挺不错的。 晚上H去参加了第一次乐团排练，不过由于是拉中提，还不是很会看谱，导致全程划水，左手随便搭在弦上，右手握弓离弦五毫米开始入迷演奏。清华的乐团总体上还是不错的，老师排练得比较细节，管乐声部很给力，虽然会有音不准的时候，但大体上都能发出好听的声音，尤其是长号，在西贝柳斯第二交响曲四乐章的结尾，让H听了真是很震撼呢，一提琴声部演奏得也还不错，首席的声音非常有穿透力，坐在中提声部里面都能听得比较清楚。H也要认真练琴了，争取之后能把乐团的曲子拉好之外，还能和各位大佬们排些重奏玩玩吧。最后还有一个小小的破冰，大概是新人自我介绍了下，然后玩了你划我猜的游戏。 明天是国庆节前的最后一周了，不知不觉开学也一个月了，H也该收收心认真搞学习了！","link":"/2022/09/25/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day33/"},{"title":"H在清华读硕的日子 day31","text":"今天是非常充实的一天，早八H上了英语课，今天的课堂一开始分了组，H认识了一些软院、电子和应数系的同学，挺不错的，大家一起讨论了美国文化背景的一二章节的读后感，算是集思广益吧，最后总结出了比较有条理的四个观点，然后H和另一个同学还一起上台进行了讲解，另一个同学说中文，H实时地翻译成英文，很欣慰的是，在结束的时候老师说了句excellent，感觉非常棒，H其实也是很享受他人对自己的夸奖的。 中午吃过饭后H就马不停蹄地前往新水利馆帮忙举办学院的集体建设大会了，帮忙搬了些水，协助了签到、帮忙各所的团支书画画等等。在集体建设大会中，H还神奇般的中奖了，虽然只是个三等奖U盘，不过也算是对今天志愿活动的奖励了。 晚上H参加了研会学术部的例会，这次讲了挺多任务的，要忙起来了。 之后H去了健身房，今天着重练了肩，好像也只练了肩，感觉一开始还激情满满，随着体力下降意志力开始有点消沉，做组的次数也慢慢降低，不行，现在的努力是为了以后的美好，一定要在即将力竭的情况再刺激自己一下，以达到突破自我的状态！","link":"/2022/09/23/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day31/"},{"title":"H在清华读硕的日子 day35","text":"今天又是充实的一天，早上上了工程硕士数学与深度学习，H觉得工程硕士数学这门课几乎已经掉队了，上课已经开始神游，各种矩阵变换看得人眼花缭乱，看样子不像是期末前花个一周就能补回来的样子，H接下来还是要赶紧将学业赶上才行，吃喝玩乐就先放一边吧。 下午H去拿了实验室发的主机，安装起来费了好大的劲，还好有F同学的帮忙，才将各种内存、固态硬盘、机械硬盘给装好了，之后要去把系统、软件啥的给好好装一下。 今天中午刚睡醒觉H就被学长cue了要招募一批志愿者晚上去搬东配楼前的僵尸单车，因为马上要进行单车棚的改造了，晚上就需要志愿者，H火急火燎地起草了一份招募广告就往级群里面发了，没想到这是一呼百应，当然有点夸张的成分，有十几个同学马上就报名了，晚上也的确来了很多人，在大家的齐心协力下，15分钟就搞定了所有工作，真可谓是团结就是力量啊！","link":"/2022/09/27/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day35/"},{"title":"H在清华读硕的日子 day34","text":"今天下午H得知宿舍的Y同学退了信息可视化的课程，开始有点担心自己的这么课程要组不到队了，然后傍晚在课程群里发了组队的信息也一直没人响应，一开始还有点担心自己要落单了，不过到了晚上十点半左右有Z同学来响应了，暂时先找到了两个人，算是先稳定了一下情绪，看看后面还有没有幸运儿加入吧。 下午H第一次参加了山野协会的训练，今天的强度算是中等吧，开局先跑了两圈，然后练了引体向上，选了比较简单的组，22333322，都能够比较好地完成，然后开始练腿了，一开始感觉还可以，直到提踵这个动作！前面的15个都能完成，后面的5个简直是在抽筋的边缘徘徊！不过总体上来说感觉非常不错，有点以前体育课的感觉，不同的是大家都是凭借着一定的兴趣来，所以大家的积极性以及训练的质量都会高些，今天还认识了一个马来西亚小哥，聊了一些天，只有来到清华这样的平台才有机会和更多的人接触啊！ 晚上H上了B老师的应用密码学，不得不说B老师讲课还是很厉害的，不过课程确实硬核，涉及到一些数论的知识，对于数学竞赛小白的H来说听得稍微有点吃力，要趁着国庆期间好好地将之前的知识总结回顾一下喽！听这个课H最大的收获是感受到了知识之间融合的魅力。密码学的推动离不开数学的发展，同时，由于需要满足计算机性能的要求，数学家们不断地继续推进对密码算法的优化，最后才有了今天这般密码体系。","link":"/2022/09/26/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day34/"},{"title":"H在清华读硕的日子 day37","text":"今天早上去接了Q学妹去实验室，H没想到由于自己来了Y老师的组里还能够吸引到学妹也一起感兴趣，突然感觉当初做的选择也还是不错的。 下午去参加了研会的破冰，认识了一些不错的人，吃了许久未尝的达美乐，玩了一些桌游，虽然H好像只参加了“行动代号”这一个，不过挺开心！ 明天要上英语课了，今天H阅读了美国文化背景第三章，这一章介绍了美国的宗教，主要介绍了新教，根据书中的介绍，H认为新教主要给美国带来三个积极的点：1. 使得美国人能够更加好地发挥主观能动性，其中提倡的self-improvement和hard-working+self-discipline，将上帝这一概念内化了，使得人们能够更加独立，更加依赖自己来创造美好的生活；2. 有助于构建一个和谐的社会，主要来源于他们所提出的volunteerism和humanitarianism，H觉得这应该也是他们建立一个较好的福利系统的根源吧；3. 有助于联合整个国家，通过宗教来提升了人们的整体认可度和归属感，有助于联合这样一个多样的国家。","link":"/2022/09/29/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day37/"},{"title":"H在清华读硕的日子 day36","text":"今天是非常充实的一天，上午去开了组会，H接到了要把勒索软件防护好好做下去的任务，顿时感觉心情激动，想要做很多事情，希望这份激情还能继续保持下去吧。 下午H去给弟弟买了一些礼物，去清华印象挑了挑，也没看到很多有意思的东西，就买了些文件夹，不过看到了一些挺不错的衣服，H准备之后自己也要去买一点。 今天有个南大软院的学妹Q同学准备进Y老师的组，H给Q同学介绍了一下组里的情况，Q准备明天来看看，挺不错的。 希望最近的事情能快点忙完吧，加油！","link":"/2022/09/28/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day36/"},{"title":"H在清华读硕的日子 day38","text":"今天早上H早八有英语课，结果发现这周读错书的章节了，就这样划了一节课，第二节课讲了essay的写作，H也没怎么认真听，感觉时间忽地就溜走了，虽然结束之后旁边的人也是同样的感觉hh。 接着H去了自动机的课，上课过程中突然意识到之前的作业有一道题忘了写空着就交了，本来想着赶紧写一写补交，结果发现作业答案已经发布了，看来是补交无望了，戏剧性地是，发现助教直接给漏了一题的作业打了100分了，安心了。 下午H开了大组组会，这次是由J学长和Y学长进行汇报，讲了数据库测试的一些话题，H听得似懂非懂，对科研的理解还是不够深入，没办法将不同研究领域的东西的共性抽象出来。 晚上H看了中国女篮的比赛，今天是与澳大利亚的半决赛，看的真是让人紧张，这场比赛是在澳大利亚打的，澳大利亚占据主场优势，裁判的吹罚有些偏向她们，不过中国队的姑娘们更加厉害，稳扎稳打，敢打敢拼，最终拿下比赛挺进决赛。H认为这才是真正的国家队：罚球10/11，内线禁飞，最后一波两罚命中带走，挺进决赛！期待明天的决赛了！ 看完比赛之后H觉得情绪高涨，晚上就去了健身房，今天练了背，做了些引体、高位下拉、两头起等等，最后还做了十分钟的单车有氧。加油，朝着更好的身体进发！","link":"/2022/09/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day38/"},{"title":"H在清华读硕的日子 day39","text":"今天是国庆节第一天假期！不过H昨天晚上失眠了，昨晚只有H一个人在宿舍，有点放纵了，睡前打了游戏，导致后面很晚才睡，没有给新的一个月开一个好头啊。 下午跟着学院去了北京展览馆参观了“奋进新时代“主题展览，大概讲得是从十八大以来国家在哪些方面做了什么突出工作，然后还参观了不同的身份发展状况，H也是大概了解了不同的省份适合发展什么样的行业吧，感觉大家更像是各司其职，印象比较深刻的有山西是提供煤炭能源，黑吉辽那边突出提供粮食，上海是进出口贸易与金融的中心，广东负责构建粤港澳大湾区，西部地区则继续在做好脱贫攻坚的工作。H觉得，既然国家地大物博，那就一定要合理利用，充分发挥各个地方的资源优势，协同构建起一个更好的国家。 晚上H去健身房练了练，今天主要练了手臂，结束之后还做了15分钟的有氧，H觉得现在的体脂还是太高了，急需降低减重啊，可不能忘了之前是怎么受伤的了。 接下来一周有好多好多的ddl，必须要打起精神来了，不然可能撑不过去了要。","link":"/2022/10/01/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day39/"},{"title":"H在清华读硕的日子 day4","text":"今日是H腿伤后的第一天，水肿有所好转，但仍未完全消去，H很感激周围人对他的关怀，包括室友Y，Y, 导员T，以及课题组各学长等等，H会怀揣信心尽快恢复，继续以健康的身体与大家共同玩耍。 早上，H与Q挑了许多电脑设备，狠狠地买了一笔 中午Q跟H说她梦到了很多曾经的画面，是啊，H和Q曾经是多么美好的一对，那样的经历，世上真的有多少人能够经历呢，奈何H犯下的错误太多，如果能回到过去，或许大部分都可避免，上天能再给H一次机会吗 昨夜，与学长们探讨未来的出路问题，经济形势不好，T大的学生也不例外，工作难找的情况也存在，在这种情况下，H还是应当做好自己的事情，与大家共同进步，与国家共同进步！ 今天H听了贝三与我的祖国（伏尔塔瓦河），感觉很好听，交响乐很宏伟，激励人心，H想加入TUSO，亲身演奏这些伟大的作品。","link":"/2022/08/27/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day4/"},{"title":"H在清华读硕的日子 day40","text":"今天H开始学习了工程硕士数学，没想到简单的高斯解方程都这么复杂，真是头大。 晚上和Z说到了关于和Q分手的事情，很难过吧，然后和Q也继续谈了以前的一些问题，感觉又像是吵了起来，确实是很难回到从前了。","link":"/2022/10/02/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day40/"},{"title":"H在清华读硕的日子 day41","text":"今天是国庆假期的最后一天了，今天是周一，一大早起来想订羽毛球场，结果一秒就没了，看来以后还是得上脚本才行。 上去H去实验室找了J学长聊了之后要做的勒索软件防护的项目，聊得感觉还行，应该有做下去的前途，看之后和老师商量得怎么样吧。 中午去参加了中提的聚餐。 晚上去参加了省实的聚餐，遇到了很多大佬，感觉女生都长得很好看呢。 晚上Q突然说自己","link":"/2022/10/03/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day41/"},{"title":"H在清华读硕的日子 day42","text":"今天是国庆后第一天开学啦，又是忙碌的一天，早上上了数学课与深度学习，现在H上数学课开始恢复以往的手写笔记了，感觉这样更能跟上老师步伐，事实上也确实能够对老师讲的东西理解得更好了。 下午H在准备明天的组会，期待能够在Y老师面前好好讲讲自己接下来计划的工作，渴望得到老师的一个肯定以及继续推进这项工作的支持。","link":"/2022/10/04/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day42/"},{"title":"H在清华读硕的日子 day43","text":"因为实验室里太多人没回来，所以这周的组会都取消了，看来向老师分享研究想法的时间得推迟到下一周了。 下午的新中特H觉得还是挺有意思的，D老师继续在讲资本主义的发展历史，现在讲到了新自由主义，讲了美国是如何渗透到许多第三世界国家并从经济、政治、金融等不同方面控制别的国家。H听了之后深感祖国之美好，同时也感叹资本之罪恶，遂立即下单了一套资本论，准备在闲暇时间研读。 最近H的感冒似乎有些加重了，希望快快好起来吧，好久也没能运动健身了，包括很多活动也没法正常参与呀。","link":"/2022/10/05/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day43/"},{"title":"H在清华读硕的日子 day44","text":"今天H仍然十分难受，深受喉咙痛的影响，话也说不好，晚上睡觉估计能上个五六次厕所，不过神奇的是，不管几点去上厕所，貌似都能碰到人，这就神奇了，大家的作息也是听不规律啊。 晚上顶着明天的ddl还是去参加了研团的第一次全体会议，大概了解了研团的架构，认识了一些人吧，但后面的桌游也没参与，似乎也没有进行太多实质性的活动，就简单放一张合照吧。 昨天在研团开会的那间办公室里，看到了墙上钉着的几个字，觉得非常有道理，“教学立院”。说实话这个又牵扯到大学的老师究竟应该是科研能力重要还是教学能力重要这个问题上了，H觉得身为人师，会教一定是更重要的，就算是做科研也是一样，古有云，”授人以鱼不如授人以渔“，难道做科研厉害的导师不也是能够将自己的科研能力传递给后面的学生吗，这也是需要一种”教“的能力啊，更不用说对于刚进入大学的本科生而言了，他们也无需科研，更多的是需要汲取新的知识来提升自己的能力，这时候，会教学就显得额外重要了。","link":"/2022/10/06/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day44/"},{"title":"H在清华读硕的日子 day45","text":"今天真的是一个super busy day！今天早上满课，H上了英语课和自动机，英语课讲了一些英文论文的introduction的一般结构，说实话认真听的话感觉也是有些道理的，H不禁在想，要是全天下的人写论文的时候都能按照这么规范的方式就好了啊，那样读论文的人可就轻松了，不过从写论文的角度人来想，这种条条框框有时候实在难以满足，可能自己想要表达就不是按照这样的逻辑架构呢？看来没办法，还是得想办法跟上论文作者的思路才行呀。上自动机课的时候可谓是有喜有悲，喜的是之前的信息可视化课程居然有人来找H组队了，估计是因为作业写不完打算退课的，这下子H的队伍就齐人啦。悲的是上课的时候H发现这次作业喜提85，以往都是100，可惜了，本来还想一直都100的，这次的一大原因是相信了网上的答案，结果网上的答案居然是错的。。。真的麻了，吃一堑长一智，以后还是要自己认真做才行呐。 下午开始H开始了造火箭计划，今日计划为建造一篇5000字的survey。一直紧赶慢赶，终于在晚上11点左右的时候结束了，真是太刺激了。中间虽然很痛苦，但是中间读到了一篇文章感觉很震撼，感觉科研的世界非常充满想象力，是一个非常自由的地方，H突然很向往那个地方了，甚至时不时在幻想自己前往美国读个博士。可能想太远了，还是继续做好当下的事情再往后看吧！ 不过嘛，人生确实还是要有提前规划，算是先确立一个方向吧。","link":"/2022/10/07/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day45/"},{"title":"H在清华读硕的日子 day46","text":"今天早上H原本想去校医院看看喉咙痛，结果在进门量体温的时候居然达到了37.5℃，发烧了！然后没办法按照一般的流程看急诊，被转去了发热门诊，做了抽血、核酸（抗原检测+鼻拭子）、CT，还好医生护士们的态度都听耐心的，可能因为这是清华校内的原因吧，所幸检查下来没什么事，开了点药就回去了。H感觉还挺幸运的是有公费医疗承担了这次开销，一共可是6、700的开销呢，其中以CT为重，不敢想象，倘若国家真的完全放开后，普通百姓是否能够有能力承担这样的诊疗费用。 因为早上发热了，原本下午和党支部一起出去看《万里归途》的计划也泡汤了，只得认真写作业，下午直接去了图书馆逸夫楼，H愈发觉得那里真是一个好地方，很安静，很有学习的氛围，今天也基本写完了数学，还有上机题留到明天。今天还帮Q看了很多数学题，感觉都挺有意思的，不过难度还是有点高呢。 最近节后时期，疫情又开始反复了，真心希望人们能够自觉一点，多一点社会责任感，让医护人员少一点负担吧，H感觉这个世界上真的有太多的人没有什么社会责任感了，可以说将人的自私性体现得非常明显，丝毫没有考虑自己的行为的后果，希望这种人能少一点吧，如果他们无法改善，那就以强力的外力使其步入正轨。","link":"/2022/10/08/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day46/"},{"title":"H在清华读硕的日子 day47","text":"今天H几乎学了一天，白天一直在写数学的编程题，其实感觉还挺有意思的，通过实现对这些算法了解得更加深入了，运行得到结果的那一刻也是非常兴奋与激动的！ 晚上因为病了请假没去乐团排练，当然其中也还有因为作业写不完的原因，之后还是要抓紧时间啊，不然这学期很快就会过去了。 今天H看了《看天下》中关于阿尔兹海默症的文章，感觉读来非常的沉重，失忆的老人不知道会给一个家庭带来多大的打击，社会确实亟需对老年人给予更多的关注了，尤其是到H这一代独生子女成长起来后，这是上有老下有小而中午兄弟姐妹的一代，养老的福利能否跟上，很大程度上将会影响到这一代人的生活压力。不过从另一个角度想，这可能也是下一个契机所在，专门针对老年人而定制化的一些商品与服务，或许将在未来10-20年内迎来一波高潮。","link":"/2022/10/09/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day47/"},{"title":"H在清华读硕的日子 day48","text":"今天又是新的一周了，早上H去图书馆赶英语essay，今天挑选了一个雅座，可惜没有拍到照片，就是一个单独的隔间，位置很安静，隐私性很好，有电源还有一块可供擦写的白板，可谓是自习的最佳去处，以后去得早就准备抢那些位置了。 晚上H上了应用密码学，不知道是不是因为上课后多看了一眼手机，H就被B老师点起来提问上节课讲的扩展的欧几里得算法是为了实现什么，H脑海里简直一篇空白，普通的欧几里得算法知道，平衡的欧几里得算法也知道，唯独这个扩展的欧几里得算法因为太复杂了之前没搞明白而不知道，虽然坐在前面的W同学轻声提示了下，但还是没能想到它的全貌，只能勉强回答是为了求bezout系数，那尴尬的场景简直让H难以忘怀，以后还是得“温故而知新”了。 今天H终于赶完了英语的essay，简单的分析了一下美国的新教和中国的儒教之间的区别以及对人们价值观产生的影响，感觉写这些能够想一些自己的想法还是不错的，但是poor的英文表达能力还是让这篇东西写了好久才挤牙膏式地写完。 这两天H静下心来学习了比较长的时间，说实话对知识的获取感到很开心，或许知识的海洋才是H的归宿？希望H能继续对所有的知识都保有这样的兴趣与激情吧，然后在之后的研究中发挥出知识的作用。","link":"/2022/10/10/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day48/"},{"title":"H在清华读硕的日子 day49","text":"今天又是早八的一天，早上刚起床H还是精神满满，第一节课上了数学课，今天倒是讲了一些很不错的东西，讲了最速下降法和共轭梯度法来求解线性方程组，一是这玩意可能在别的课上也听得比较多了所以比较熟悉，二来这些玩意在讲解过程中展现出了非常神奇的性质，所以H觉得很感兴趣，这些都是数学家们的思想结晶啊，他们让计算的效率不知道提高了多少倍，也不知道将多少仅存于理论中的应用化为现实中造福人类的应用，比如深度学习。 第二节课就上了深度学习，这两节课都是在讲各种CNN的网络结构，说实话听得很累人，两个多小时的时间基本上是走马观花式地将不同的网络结构过了一遍，虽然S老师讲课非常流畅并且也很有激情，但是东西实在是太多了，而且这东西看起来并没有太多很solid的理论支撑，大多是凭借经验总结而来，所以看起来也只能尽量依靠记忆记下来了。一个上午的课可谓是非常的工科了，这些学科都基于一定的理论基础，但是碍于工程实践上的约束又不得不采取一些折中的办法来权衡理想与现实之间的差距，不过在其中追求性能极限的思想还是很吸引H的，其实人类活在这世上就是这样，理想与现实之间总存在着一条鸿沟，我们不过是尽力让生活能够贴上我们的理想罢了，即使无法完全成功，但是努力慢慢靠近的过程就足以让人享受。 也不知道是感冒还没好还是早上起太早还是上课太无聊还是天气到中午过于炎热，H在上深度学习的第三小节的课的时候就已经心不在焉了，很饿，很热，很困，吃完午饭后立马睡觉，本来下午还想着去图书馆的，结果直接睡到了三点，只得随便看了点论文。 下午四点半到六点半去乐团那边上小课了，老师是来自国交的sihua老师，老师长得好看，人也好，当然技术也好，带着大家排了威风堂堂和西二四，一开始只有H和Y同学到了，一对二的场面着实气氛有点尴尬，更甚的是H的技术还听不咋地，不过也获得了慢慢找音的机会，中间总会有适应的过程嘛，希望H能越练越好吧。 晚上又是Y老师的水课，说实话课堂的氛围很尴尬，主要是Y老师挺喜欢冷不丁地提个问题，但是下方众人几乎都没有反应，H也为Y老师赶到尴尬，更麻烦的是，因为是Y老师组里的学生，每当点名的时候H都只敢低着头，万万不敢与老师对视，生怕下一秒就被cue到。","link":"/2022/10/11/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day49/"},{"title":"H在清华读硕的日子 day5","text":"今天仍旧是在宿舍休养生息的一天，早上，H和舍友们组装起了购买的衣柜，提升了宿舍的空间利用率 今天H在宿舍看了几集《爱死亡机器人》，H觉得拍的还不错，今天把第二季都刷了，之前听人说第二季是相对无聊的一季，但看下来感觉也还可以，画面的制作逼真、特效华丽不说，其立意是更加吸引H的地方，只是许多剧情初看未知其深意，待看完解析后方能领悟其深刻的含义，H的思想境界仍有待提升。 今天Q身体不舒服，然而还是不高兴，所幸晚上出去逛街买到了好看的衣服，吃了顿大餐，心情或许恢复了些许 H今日仍然阅读了《看天下》，今日所读主要涉及两个议题，一个是关于“剧本式教学”，一个是关于海归归海的事情。 “剧本式教育”主要所讲的是一对哈佛毕业的夫妻在非洲落后地区开发了一种“流水线式的教育”，即任课老师拿着指定的剧本来开展课堂教学，剧本的内容甚至精确到了在第几分钟应该说什么话。这种教育模式尽管为许多教育学家们所诟病，但H认为，在整体条件落后的地区，任课教师的水平也不佳，采用这样的方式来进行教育也是无可厚非的，只是这并不是长久之策，待地区水平有所提升后，这种方式应当有所改善。H还认为，这种“剧本式教育”其实与指令化的程序并无太大差异，不妨加入智能化的方式，加快普及力度，节约人力层本，更快地让落后地区的人民水平得到一定的提升。 海归归海的问题，H认为这是一个非常深刻且值得思考的问题，毕竟人才愿不愿意留在国内，决定了国家能否更好地发展。总结文章中所提到的一些海归们不愿意待在国内的原因：1. 工作太忙，不能达成work-life balance，有的国家甚至实行一周工作四天，并且员工有权拒绝加班；2. 工作造假，国内的有些行业内的公司为了更快地抢夺市场，不惜造假来夺取利润，例如留学行业；3. 传统观念，例如性别歧视与应酬文化，这些对于接触过许多国外文化的人来说都是些落后且拘束的条条框框，使得在其中工作的人反感。H也认为，以上原因着实会触犯到很多人的底线，为了生计，许多人不得不放下自己的尊严而被迫随波逐流，剩下的，则挣扎着被时代的洪流裹挟着前进。H觉得，所谓应酬吃饭，原本是一种不错的相互交谈的形式，然而畸形的“酒文化”使得其大大地变味，这些必须是国家迈向一个更高层次所必须要解决的问题。同时，H仍然对未来的生活充满信心，尽管如今的经济仍然处于下行位，尽管大家都在卷，但是需要认识到的是国家的人口数量在下降，劳动人口数量的下降，或许会使得工作岗位的增多，加上二胎三胎政策的开放，H这一代或许是人口结构呈现两头大中间小的中间那部分，他们必须肩负起更重的担子，承前启后，照顾好家人，抚育好更加充满希望的下一代。","link":"/2022/08/28/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day5/"},{"title":"H在清华读硕的日子 day50","text":"今天早上开了小组的组会，组会前H听到了一些关于组里的消息，昨天Y老师还所组里有个同学中了EMSOFT的Best Paper，结果今天又被其他人给抢走了，太遗憾了，也不知道究竟是什么原因导致的，不过真的有点气人，希望大家再振作起来，下次再把荣誉夺回来。早上的组会H报告了自己关于勒索软件防御的新的想法，老师觉得也还可以吧，接下来要认真推进了，希望能做出点成果来吧。早上还听闻了一些关于Y老师的消息，Y老师似乎被人针对了，组里的19年，也就是3年前的论文都被人揪出来有问题，正好也听说Y老师下半年就要晋升为长聘副教授，其中的争斗也真是令人唏嘘，明明是做学术的事情，追求科学与真理的行业，居然被搅得这样，叫真正的学者如何能够真心留在这里，留下来的人又有多少人能保持住他们的真心。 中午吃饭的时候Y老师发了一条新闻，说是今年的诺贝尔经济学奖得主Philip H. Dybvig于前两年被西南财大因为考核不过关而开除了，很多人在说是不是中国的制度有问题，其实H觉得也不然，这件事情对于公众来说有点不透明的，公众看到的表象是他获得了诺贝尔奖，并且从西南财大离开，但是并没有详细地说明他对西南财大的贡献究竟如何，究竟是我们的制度出了问题呢，还是他确实因为平常身在国外导致对学院并不十分上心呢，对于这种事情希望还是有个深入的了解后再做出评判，而不是无脑吐槽啊，因为H也不太了解个中缘由，所以也无法下定论。 下午H上了新中特，又是批判西方资本主义的爽课，听得也很开心，不过其中的某些问题，其实很渐渐在我们国家显现出来了，H感受比较突出的是贫富差距的加大，发达城市和一般城市，甚至在同一城市内部的不同层级的人群之间的贫富差距都已经到了比较大的地步，倘若这持续发展下去肯定会出现问题的，希望国家会及时站出来解决这些问题吧，社会稳定还是社会大部分人民能够美好生活的基础。 晚上H去了研团大‘V’开会，接了个清扫实验室的志愿活动，推行起来估计是有点挑战的呢，希望能和W同学一起办好，看看怎么想些比较好的点子吸引大家进来呢。 开会结束后，H去了图书馆，不得不说清华的图书馆确实挺不错的，很有学习的氛围，今天做了点自动机的作业，然后还帮Q看了看起来很复杂的金融数学题，虽然很难不过也还算是有点意思，不过要是H的知识储备更多点，能够知道题目想表达的这是含义就好了。","link":"/2022/10/12/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day50/"},{"title":"H在清华读硕的日子 day7","text":"H早上观看了瑞·达利欧的视频，简单摘抄里面认为重要的一些话语来勉励自己 try to find the smartest people I could find who disagreed with me and to have them stress test me and my thinking. pain plus refection equals progress 早上学校举办了关于硕士生/博士生未来发展方向的讲座，H看了之后不禁觉得大家都是有志青年呀，清华的学生有前往家乡基层一线工作的，有在一线科研的，有在行业领军企业里面工作的，都是十分可敬的人。H也要尽快开始对未来进行筹备了，尽管选择是多种多样的，但不做出选择，那就一件也没法获得，尽快找到一条对自己对家庭对社会对国家都有所益处的道路吧。 下午学院的讲座讲了些关于学风道德建设之类的话题，除了看了下学院的M院长的模样，H也没留下什么深刻的印象了。 H决定开发自己的技术博客，网址就定为colahua.tech，暂时准备开辟两个栏目，一个叫做talk is cheap, show me the code用来进行一些算法描述并附上自己的代码实现，另一个栏目写一些经典的论文读后感。 明天就要开始课程预选了，H晚上策划了一下怎么安排时间，准备多选点有技术含量的课，提升提升自己的水平。 明天就是学校与学院的开学典礼了，可惜因为脚伤的原因，H只能在宿舍远程观看，没办法到线下看到同学和老师，也是十分遗憾。","link":"/2022/08/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day7/"},{"title":"H在清华读硕的日子 day8","text":"今天是清华研究生的开学典礼，H的腿还没恢复，暂时只能在宿舍线上观看，听了王希勤校长，几位老师，几位同学的发言，大体上也是在讲“空谈误国，实干兴邦”之类的话题，鼓励大家做实事，结合之前在课题组Y老师提到大家要多做落地的项目，看起来国家的策略就是要往实在的方向转移，H认为这是一件不错的事情。 晚上发生了恐怖的事情，H的宿舍因为没有关阳台门，进来了很多虫子，真是吓坏了，整个墙壁上都是，一开始有点惊慌失措，不过后来回想到宿舍群里有人提到此事，遂赶忙查阅聊天记录，发现这些应该是趋光性的虫子，马上将天花板上的灯关闭，在地板上开了一个酷毙灯，过了一会儿终于是将大量的虫子赶了下来。H还是不放心，赶忙购置了一个文章，在自己的床上建立了一个隔离保护地带，终于是能睡了一个安稳觉。","link":"/2022/08/31/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day8/"},{"title":"H在清华读硕的日子 day9","text":"今天照旧是在宿舍休养的一天，早上学校的讲座讲了关于艺术与科学，可惜今天H在赶Q的任务，所以没怎么听，或许有点遗憾，不过凭借自己学小提琴的经历，或许也能够有所感悟。 下午学院开了关于疫情防控以及实验室安全的讲座，虽然都是些很基本的东西，不过人命关天，多注意点还是好的。 今天H已经可以自如地采用拐杖上下楼了，晚上去紫荆篮球场做了个核酸，回来后在楼下走了走，吹着夜晚凉爽的微风，甚是惬意，如果不是腿受伤的话，H应该每天晚上都会在校园里面游荡吧，当然，如果是和Q一起走的话就更好了。 H上楼的时候特别注意了下，每层楼间的台阶数量由10+5+5组成，看来大家都是很喜欢10呀5呀的数字的嘛，不知道建楼的时候是不是这样想的呢哈哈。 今天H照旧是看了《看天下》，今天主要看了印度关于不同信仰间排斥的问题，主要是印度教和伊斯兰教间的矛盾，印度教的人疯狂排挤穆斯林，希望将整个印度变为统一的印度教，说实话，H并不太能理解宗教究竟是如何影响人的，为何一个虚幻的东西竟成为同胞相互排挤的原因，甚至引发多场血案，人们呐，还是应当有包容的胸襟才行。","link":"/2022/09/01/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day9/"},{"title":"H在清华读硕的日子 day6","text":"今天早上学校开展了关于二十大和关于学籍的讲座，H心不在焉地听完了，因为下午有组会，H还在赶着收集一些资料，制作ppt以向老板展示自己的工作进度。 下午开了组会，H因为腿伤只得在线上参与，听着学长们对新课题的讲解与探索，以及老板对于学长们提出的意见，H觉得收益匪浅，老板在积极地引导着大家往实用性的方向上靠拢，而不是制作一些科研的toy或者game来自娱自乐。自娱自乐以达到自我满足，这是一个多么常见而又多么容易被人忽视的问题啊，很多时候人们都只站在自己的立场来思考问题，而没有站在对方的角度来思考自己对于他人的意义，人们总是揣测他人的需求，自以为满足了他人，殊不知换来的只是他人勉为其难的一笑。是啊，要想在这个社会上有更多的建树，人们还是得”务实“，仰望星空的人为前进指明了方向，脚踏实地的人为前进提供了动力，继续努力吧，希望H能够在这个领域有所建树。 今天H学习了瑞·达利欧的经济是怎样运行的这个纪录片，里面主要讲述了经济中的关键活动信贷，短期债务周期和长期债务周期，以及解决通胀的四种传统方法：削减开支、减少债务、财富再分配、发行货币。H不是第一次看这个视频了，不过每次看了都会对其有更加深刻的理解，或许这就是阅历、眼界变得开阔对人的影响吧，虽然H未来的志向在于对技术的研究，不志在经济与金融领域，但是H觉得这挺有趣，决定在未来继续深入了解。 晚上H报了软院的研团招新，想去志愿部，一来可以获得一手的志愿活动信息可以参加，二来可以出去玩，三来可以认识多点人，四来可以锻炼自己的能力，希望能成功加入吧。","link":"/2022/08/29/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day6/"},{"title":"H在清华读硕的日子 day51","text":"今天又是个忙得不可开交的一天，早晨起早去了图书馆，今天H又抢到了单人豪华雅座，不过其实发现那个地方也不太好，网络不好呀，不过非常适合静下心来学习，可能对于学数学啥的人来说更适合把，拍张照片纪念一下。 早上花了一个多小时才写完了自动机的最后一个作业，这就是上节课没好好听课的后果，一个简化的DFA的题目写了好久，看来以后还是得好好听课。 写完作业后去上了数学课，今天讲完了共轭梯度法，然后布置了新的作业，然后开始讲非线性方程组的求解了。压力山大，不过还好每次开新的篇章的时候都还比较简单，只是越到后面越复杂起来。 中午开了团日活动，班级讨论了七名同学成为入党积极分子的相关事宜，看起来全国9000多万党员的数量还在继续茁壮成长着。会议中有个环节是每个同学进行自我评述，虽然说这可能是个比较走过场的流程，但是H觉得大家都还是讲得各有特点，让H最印象深刻是有人谈到要从“历史与制度”的方面来理解我们党，H觉得说的非常有道理，我们看事情的眼光一定要放得长远，一件事情的对与错，有时候可能不是因为某个人某个集体或某项制度造成的，而可能是历史发展所必然经历的，例如环境污染，八大公害等等，既然历史最终可能会导致这些事情的发生，我们应当坦然接受，并且尽力去弥补便是了，过多的无用的指责只会是浪费时间而已。除此之外，我们还必须认识到，历史既然会在某个特定的时间做出适当的选择，那么也会在某个时间抛弃掉不适合的选择，因此，顺应历史是任何事情得以长期存活下去的根本，世界上的每个人，每个团体，每项制度都应该清醒的认识到这一点，在成长中存活，才是唯一长久的出路。 晚上Y舍友请了大家去吃翘脚牛肉，very delicious，顺便还吃了五道口那边的枣糕王，挺不错的，等H感冒好了还要多吃点美食。 晚上一直在赶勒索软件相关的事情，明天Y老师要去和企业谈合作了，希望能顺利吧，让H的研究能够更加的实在，同时有个依托也能够发展得更顺利些。","link":"/2022/10/13/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day51/"},{"title":"H在清华读硕的日子 day52","text":"x 今天是一周的最后一天了，相对轻松的一天，虽然是从早八开始。早上老师检查了上周的论文introduction阅读与批注情况，H是昨晚九点多才匆匆忙忙弄得，与旁边同学相比发现真是水极了，不过还好老师也没怎么细查。之后做了一个托福的听力，H发现自己的听力水平着实有点下降，虽然听得过程中还算能听懂，但是关键信息都由于一些不懂的词汇导致没get到，感觉英文水平还是有待提高，这样才有出国的可能啊。 之后H去上了自动机的课程，有一说一，M老师讲课还是非常认真的，可能是课程内容不太吸引人吧，导致没什么人上。上课过程中还发生了一些小插曲，昨天晚上Y老师本来约了早上的腾讯会议与企业谈勒索病毒防护的合作项目，结果H忘了请假了，不过也还好事情不太大，J学长和W同学都在线，H也通过W同学的记录了解了开会沟通的一些内容，不至于处于一种懵逼的状态。 中午和R同学一起去吃了午饭，R同学是清本升上来的同学，H也从R同学那儿了解到了一些故事，比如说M老师的本科课程很硬核，会挂人之类的，还了解了下Y老师（和H的导师Y老师同办公室的另一个Y老师）在系统所的不得志的地位等等。 下午开大组会就很轻松了，今天是Z学长做了关于测试evaluation的报告，同时还介绍了他的突出工作wingfuzz，wingfuzz最近在google的fuzzbench的评比中击败了众多主流的fuzzer，一骑绝尘拿下第一，看得出来Y老师对这个结果甚是满意，是啊，人呐，总是得在某些地方出一口气，让别人见识到自己的厉害才行。话说回来，通过Z学长的介绍，H了解到了当前主流的工作中存在的众多不合理的地方，既然近年来的工作其实都成效不明显，那也表明这个领域还是大有可为的，希望H所在的团队能够成为下一个fuzz高潮中领先的团队吧。 下午开完组会后，H急匆匆地去帮Q解决了作业，概率论呐，仍然是非常棘手的问题。而且还了解到Q的队友特别坑爹，本来的分工是3:3:4，结果队友都不干活，最后变成1:1:8，Q完成8的工作量，真是坑爹，希望之后队友能给力吧，不给力的话也别给她们面子了。","link":"/2022/10/14/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day52/"},{"title":"H在清华读硕的日子 day54","text":"2022.10.16 星期日 晴 二十大、“一二九”动员会 今天是个大日子，我们党的“二十大”召开了！不过今天H还没有认真学习，一直在赶作业，还有帮Q看一些面试相关的题目，等到下周四开党组织生活了一定好好学习！毕竟国家的战略还是必须得好好学习学习的。 下午Q参加了Optiver的oa，听她说这考试还挺有意思的，有速算、有小游戏、有考找规律的，当然也有硬核的概率论，看来这种外资的投资企业招人相比国内的一些企业专门考些“八股文”还是要强些！ 晚上学院召开了“一二九”合唱比赛的动员大会，当然一开始也都是讲了一些不痛不痒的历史，大致就是告诉大家要积极参与进来，传承我们的精神！不过关键信息还有有一些的，比如这次是和建筑学院联合，据说是男女比例互补，不过从现场情况来说男女比例并没有得到十分有效的改善，但确实还是见到了很多女生hh；还有就是说参加这个活动跟奖学金评比直接挂钩，说实话H感觉这个有点离谱了，可以号召大家积极参加，但如果什么活动都要和一些评比什么的挂钩，难免让人显得有点势利，不过可能为了凑够人数也只能出此下策了；感觉上面都是说了一些不好的，再说些好的，这次我们的选取为《同一首歌》，还是一首挺不错的歌，感觉能够合唱出一定的味道，并且难度应该还算适中，之后的日子据说一周要有两次排练，不知道是不是真的，那样确实是有点忙了，毕竟大家还是都有很多作业在身的。动员会结束之后还进行了分声部环节，有两个比较专业的同学听大家的音阶然后帮大家分声部，H感觉唱音阶比真正唱歌曲要简单呢，感觉可能分到了比较高的声部，并且初评还可以？之后要认真参与参与喽，希望通过这个也提高提高自己的歌唱水平吧，当然最重要的还是享受音乐，除了交响之后再好好感受一下合唱的魅力吧！","link":"/2022/10/16/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day54/"},{"title":"H在清华读硕的日子 day53","text":"2022.10.15 星期六 多云 班级香山团建、志愿部Y学长请客聚餐 今天H迎来了第一个与班级同学共同出去团建的日子，这次挑选的目的地为香山，地址选的不错，既红又是户外场所，挺适合团建的。早上八点半就集合了，先是从中央主楼坐大巴去了东南门，然后在那里又换了一个车坐到了万安地铁站，然后又坐地铁前往了香山地铁站，最后一公里采用走路的方式走到了香山景区门口，这安排，着实有点绕呀。 到了之后大部队先出发前往了双清别墅，就是毛主席当年在香山居住办公的地方，里面的环境比较优美，是个不错的园子，也看到了一些关于当年解放工作的记录，很有历史学习价值。 看完之后大部队就上山了，爬山嘛，还是一个又累又快乐的活动。中途和W同学聊了一些关于课题组的故事，聊到了Q学长和W学姐的故事，听闻了J学长的美丽又气质的女朋友，感觉H还是来到了一个非常轻松活泼的实验室，Y老师也是一个比较喜欢而且能搞事情的老师嘛。 爬到山顶之后，由于天公不作美，今日空气质量有点差，导致山顶的视角并不十分清晰，没有拍到比较好的俯瞰京城的照片。在山顶稍息片刻后，大家就坐缆车下山了，此缆车非H平常想象的那种有大包厢封闭的缆车，而是只有两个座位的那种“露天”缆车，说实话一开始还是有点吓人的呢，不过还好后来运行得十分平稳，匀速下降，没有什么失重感，不过有一点小插曲是快到山底的时候突然卡壳了，突然开始晃了起来，跟荡秋千一样，真是突然的刺激！ 下完山之后也一点多了，大家也开始原路返回学校去，回到都两点多了，肚子饿的咕咕叫，还好志愿部的Y学长站了出来，带领大家去丰茂烤串来了聚餐，吃了很多串，牛肉串、烤肠、肥牛、鱼豆腐等等，very delicious！还和大家玩了拆弹猫、uno的桌游，非常开心，甚至还有真心话大冒险环节！合照里Y学长的眼神也是亮点hh，一直不知道在看哪儿呢！ 晚上H和T打了电话，T今天从学校回来了，今天举办了成人礼，T说他们班请了一个同学的爸爸为他们举办了一场讲座，聊到了很多未来的个人与国家的发展方向，让T受益匪浅，是啊转眼间T也成年了，希望T能尽快拓宽眼界，找到自己喜欢的未来的道路，然后能够顺利的发展下去吧，希望H和T能够携手为家庭创造一个富裕的未来！","link":"/2022/10/15/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day53/"},{"title":"H在清华读硕的日子 day55","text":"2022.10.17 星期一 晴 修电脑、上课、篮球赛vs苏世民学院 早上H去五道口那边的华为售后服务店去检查了下笔记本的电源问题，前两天不知道怎么回事儿电脑突然出现蓝屏，之后电池的续航就变得好差，几乎比蓝屏之前减少了一半，然而今天去了店里得到的反馈是电脑的电源没有问题，而且也有其他的消费者也提出了这款电脑在使用了一个月后续航出现下降的问题。Huawei Matebook X Pro呐，怎么说也是国产里边不错的商务本了吧，居然还出现这样的问题，看看Y舍友的mac，用起来续航8-10个小时的开发都没有问题，啥时候咱们的电脑也能变得更好？ 早上除了修电脑之外，H还去了图书馆研究密码学里面的”基本“数论知识，虽然这些东西确实还挺有意思，而且对于理解现代信息安全领域的加密具有十分重要的意义，奈何H的数学水平感觉有限，看许多知识点都能卡个半天，不禁想问H，还能回到曾经的智力巅峰吗？看这个密码学知识还有一个重大原因就是上这门课的B老师实在是太喜欢点人回答问题了，为了显得自己厉害一些，H还是决定每节课课后都做复习，课前都做预习，当然喽，这样对H理解知识本身也是具有极大的帮助的。另外，晚上真正上这节课之前，助教和老师又开始新一轮的劝退了，不过H还是决定留下来，一方面嘛，退课要记录W，这个心里有点过意不去，另一方面，研究生阶段对成绩的要求应该也比较低，能够学习一些比较实用的知识也是很有收获的一件事情。 下午H去看了软院和苏世民学院的篮球比赛，不能说技术不够，只能说身体实在是差得有点多，苏世民学院的同学都是身强体壮，看起来牛高马大的，冲抢篮板几乎碾压了软院的内线，看完比赛，H只想立马去锻炼，练成跟他们一般强壮，虽然身高不够，也要在速度和力量上能够与他们抗衡。下学期听说有新生的篮球赛，H也要抓紧复健了，希望下学期能够上场和队友们一起比赛，拿到满意的成绩！ 今天H在朋友圈看到了一篇推文，名为《边听课边回微信边写作业？你可能被多任务骗了》，文章从大家上课时经常多线程工作，”刷微信，处理社工任务，写作业“等情况谈起，指出这种行为其实是一种极其低效的行为，其根本原因在于人类的大脑在同一时刻其实只能专注地处理同一件事情。文章还指出，虽然大家可能在这种”多线程“中收获很充实的感觉，觉得自己对时间的利用达到了极致，但其实非也，因为任务的转换其实也是需要消耗大量的时间的，所以大家可能是陷入了一种虚假的充实感中，这是一个大家都需要避免陷入的陷阱啊。文章说的确实很有道理，H以后也要专注起来，对待事情要持有专一的态度，但是时间的分配嘛还是可以做到比较多样化的，这样才能拥有一个比较协调平衡的生活！","link":"/2022/10/17/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day55/"},{"title":"H在清华读硕的日子 day56","text":"2022.10.18 星期二 晴 上课、跑步、思考：工科学习vs.理科学习 上午H从早八一直到十二点十五都有课，今天早上学习了数值分析和深度学习，不得不说H这学期将这俩课排在一个上午还是挺不错的，一来这俩学的东西有一定的交叉，二来这两门课程非常能够代表工科课程的风格，与昨天的密码学简直可以说是对比明显。学习工科课程，不仅要学习后面的理论支撑，更要学习的是，如何将这些理论所支撑形成的方法运用到实际的项目中去，当然了，在这两门课的背景下就特指的是将各种算法化成计算机可求解的程序。在这些工科学科的发展过程中，对性能的追求可谓到了极致，简直可谓是一种精益求精的过程，H觉得这个过程甚至有一种艺术品般的美感。如果说理科是对真理的极致追求，那么工科则是对工程应用的实用性的极致追求。这种追求完美的过程，H觉得很赞，H觉得平常的学习与生活，其实不也是这样一种过程吗，不断地追求更适合于当前环境的解决方案，学习的过程，其实不仅仅是学习各种简单的算法，更重要的是，我们还在学习这样一种精神，有了这种精神，我们就有了更好的支持我们前进的精神动力了，不是吗？ 下午H去跑了步，不得不说之前感冒了之后现在的体能确实很差，不过今天还是坚持下来一共跑了7圈（包括热身）以及一些高抬腿、后踢腿等训练，后面要抓紧时间锻炼了，要趁着更寒冷的天气来临前将身体调整到一个健康的状态啊。","link":"/2022/10/18/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day56/"},{"title":"H在清华读硕的日子 day57","text":"2022.10.19 星期三 晴 组会、乒乓球 今天又开组会了，不过最近H感觉都没做啥，作业是有点小忙，以后要多抓紧点时间了。这周组会W分享了一个勒索软件攻击的模式，大概就是一种将攻击分散到不同的时间区间来进行的方法，并且在加密文件的时候采用了隔段加密的策略，通过这两者来绕过防御工具的检测。这与之前J学长投的论文的思想有异曲同工之处呢，希望之后大家能一起把这种攻击给顺利防御下来吧。 下午H上了新中特，今天终于开始讲到跟社会主义相关的话题了，之前基本都在大力地批判资本主义，虽然资本主义能够打破马尔萨斯陷阱，但是其弊端体现在其无法使得社会到达一个更高的层次，而社会主义可能在社会的等级上要优于资本主义，但是到达真正理想的社会主义还是非常困难的，要求一个国家与社会的生产力水平都达到一个较高的水准，所以说，我们国家的发展，最好是得两手抓，汲取双边的优势，既要通过一定的资本运作刺激经济发展，快速提升生产力水平，又要合理地控制住度，不能让国家沦为资本的工具，这样才能真正实现一种健康的发展。 晚上H和Y去打了乒乓球，借了东配楼即刻运动空间的球拍和球，一开始想在东主楼的球台上打的，结果有同学提前在那儿开打了，快速查看了50.tsinghua.edu.cn网站上也发现没场了，正当以为要寄了的时候，Y发现了Fit楼的负一层有乒乓球桌，赶忙前往那边去查看，结果发现真的没人！但是环境是真的难以言表！看样子那个地方是在一个防空洞里，混乱地摆放着几张乒乓球桌，甚至连网也没有，H和Y还是费了一定的力气才把网给搭了起来。后来和Y打得也很爽，简直是“旗鼓相当”的对手，打得很嗨，以后有空还会多来！","link":"/2022/10/19/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day57/"},{"title":"H在清华读硕的日子 day58","text":"2022.10.20 星期四 晴 “一二九”合唱排练、英国首相特拉斯辞职 早上H上了工程硕士数学，今天上课感触最深的是方法的通用性，之前在解线性方程组中学习了jacobi, Gauss-Seidel, SOR迭代法的方法来求解，今天学习非线性方程组求解中居然也有他们的身影，不得不感叹，这些方法之所以能够被写进教科书，真的是有十分充分的理由的，他们不仅效果好，而且还具有通用性，因此能够经久不衰，H也希望自己未来的工作能够朝着这方面发展，做出通用的成果，发现一些“真理”，流芳百世造福人类。 下午H去实验室赶作业，赶的正是数学作业，结果遇到了非常坑爹的事情，看错题号了！本来是一个非常简单的问题，结果看成了一个非常复杂的问题，本来只是解一个五对角的线性方程组，结果看成了一个什么求解泊松边界值问题，费了太多时间了，以后要更仔细点啊，要相信老师不会这么刁难的呀。 晚上在西阶梯教室进行了第一次“一二九”合唱的排练，第一次是指挥的同学带着练了练声，都是些基础的东西，不过对合唱还是蛮有用的，毕竟合唱不同于独唱，是一种集体性的表演活动，甚至比乐团对演奏法的统一性要求更高呢，不然确实不好听呀。今天指挥教了一些呼吸的方法以及唱了一些音阶，感觉真的要唱好还是不容易呀，希望大家都能加油吧，既然参加，便奉献一场精彩的演出，毕竟离开了这个学校，估计也就没有这种机会了。 今天听说英国的首相特拉斯辞职了，这似乎是今年的第二起英国首相辞职的事件了，也不知道究竟是发生了什么，女王离世后，难道英国真的要陷入一种混乱的境地了吗，西方国家会怎么变化呢？","link":"/2022/10/20/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day58/"},{"title":"H在清华读硕的日子 day59","text":"2022.10.21 星期五 晴 练琴、大组会、学术自由、学术与工程 下午H终于又去练了会儿琴，说实话viola的音色还是挺不错的，非常厚重，也可能是琴确实还不错吧，相比起H自己的小提琴真是好太多了，今天练了会音阶，找了下二把和三把的音，然后练了下西二四，现在认谱感觉好了挺多，以后还要多练一点呀，最好每天都花个半小时左右练练吧，然后寒假看看能不能排点什么小重奏玩玩呢。 下午开了大组会，今天是J学长讲了勒索软件防护相关的，大概是讲了现有的很多工作都又over-optimization的一种情况，不过其实H当时试了一下，对于一些勒索软件还真是特征非常明显，随便上个什么模型基本上就能达到95%以上的准确率，不过事实是勒索软件仍然是并且还将是非常猖狂的一种安全威胁，所以好好做吧，希望能做出点实用的东西来。 晚上吃饭的时候和Y学长聊了些关于学术自由以及学术与工程的话题，当然，此处的学术自由只是狭义地指代学术的方向选择上的自由度，目前H所在的学院大概是这样一种情况，各位博士的研究方向需要由超级大老板G进行审核，而G老师现在似乎更加倾向于需要能够落地的项目，因而在各位博士的方向上有所“限制”，顺带当然也影响着Y老师的方向选择。怎么说呢，感觉问题还是出在“钱”上面了，如果国家能够给多点钱下来做科研，当然大家都能够在一个更加自由的环境做研究，当然了，在现在这个环境下，希望大家都能够有所妥协吧。上面的人既不能让下面的人做太多违背意愿的事情，下面的人也不能完全不顾虑大局而一味地追求自由。社会就是这样，需要找到一个平衡点，才能让各方都稳定地前进。","link":"/2022/10/21/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day59/"},{"title":"H在清华读硕的日子 day60","text":"2022.10.22 星期六 晴 赶作业、绘画体验、“一二九”合唱排练 上午H赶了数学作业的计算实习，感觉这种作业真的是好麻烦，因为它不像是一般的代码作业，一般的代码作业只要满足特定的要求即算完成，但这个作业要求比较笼统，要求写实验结果，导致H不知道究竟是写多少合适，就近是写得多么精细合适。还有一点就是数值分析实践起来比理论复杂太多了，计算精度这个问题会导致程序会出现各种神奇的事情，尤其是这次的作业还要研究一个病态的希尔伯特矩阵，真是做得让人头大。 下午H去参加了研会组织的画画活动，是由清华美院的老师来指导大家画画。今天应该是H第一次用丙烯颜料吧，在了一个油画布上进行作画，今天花了一个风景画，说实话，有一种很强烈的”可远观而不可亵玩焉“的感觉，虽然近看感觉非常得没有章法，但是远看感觉还不错呢，有点感觉。 晚上去参加了”一二九“合唱的排练，今天指挥带着大家走了整个谱子，说实话感觉单独唱都比较简单，但是一合起来的话容易找不到音，低音声部和高音声部都是如此，感觉真的要排好的话的确需要非常多的时间，希望大家能够共同努力吧，既然参加了，就be the best！享受音乐！ 今天的会议似乎发生了些什么，H在外网也看了视频，具体发生了什么也不好评价，还是希望国家和社会能积极发展吧，是好的，咱就积极接受并支持，是坏的，咱也要自行自我改正，让国家顺着历史朝着更好的方向发展吧。","link":"/2022/10/22/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day60/"},{"title":"H在清华读硕的日子 day61","text":"2022.10.23 星期天 晴 赶作业、乐团排练 今天是一个超级busy day，从早到晚基本上就只做了两件事，赶作业与排练，本来H打算今天把深度学习的作业也写一写的，但是由于进度原因还没开始，接下来的一周要更加抓紧时间了。 下去和晚上都去参加了乐团的排练，都排的是《人民万岁》曲子，感觉难度还算偏小，所以H勉强也能跟上。下午是分排，由中提的S首席进行带排，没想到的是直接变成了一对一排练，今天只有H去了，不过也还好，正好趁着下午上了下手，而且S首席确实厉害，不仅自己拉的厉害，而且感觉也能给出很多有建设性的意见，比如在乐团中拉琴如何快速识谱，如何快速挑选出合适的指法，以及如何运弓以发挥出中提琴最佳的音色。晚上的排练H第一次见到了乐团的L指挥，L指挥虽然看起年纪比较大，但感觉还是充满了幽默感，而且对待音乐也很细致，两个多小时的时间就只排了这一首，当然了，也可能是因为马上要用这一首曲子去比赛的缘故，希望之后能演好吧。 小小地记录一下今天排练中的笑话。 L指让弹竖琴的同学solo了一下开头的部分，然后L指满意地对该同学说，弹得非常好，就是咱们乐团的琴不够行，结果，该同学回复，“这是我自己带来的琴”，全场直接爆笑哈哈哈。","link":"/2022/10/23/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day61/"},{"title":"H在清华读硕的日子 day62","text":"2022.10.24 星期一 晴 工作与生活的意义、密码学 早上H去了实验室，闲暇之余看了下最新的《看天下》，今天阅读了关于工作的意义相关的讨论话题，大致是在讲现在很多人都对工作失去了兴趣，因为他们觉得工作没有什么意义，然后讨论了热爱是否是支持大家长久工作的良药。H觉得，真正能够支持大家长久工作的，是一个自由的环境，人，天生就是非常具有想象力的动物，而且人最难受的就是被拘束，如果说人的行为被拘束是在如今这个工业化发达的社会里工作必须要承担的，那么对人的精神上的拘束就是压倒很多人的最后一根稻草。我们的社会的发展一定要朝着自由的方向前进，只有充分释放了人的主观能动性，人们才能在工作中做出更多有创造性的工作，人们也才会觉得工作是自己可控的，生活真正是自己想要的。 晚上又是精彩的密码学课程，B老师感觉像是刻意降低了难度，将中国剩余定理的计算介绍得非常详细，而且还让同学上台进行具体的演算，H也是难得得整节课都听得很明白，而且其中的RNS结构，让H感到非常的震撼，怎么会有如此优美的数学结构，数论果真不愧为数学中的皇冠啊。 下了课后和J学长一起开了勒索软件项目的会，讨论了下项目后面的一些进展，看来后面是要加把劲肝起来了，得多线程兼顾项目与作业，希望在年底之前能做出来吧（不过好像做不出来也得做出来）","link":"/2022/10/24/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day62/"},{"title":"H在清华读硕的日子 day63","text":"2022.10.25 星期二 晴 健身房复健 早上H鼓起勇气问了W要不要作为自己的舞伴一起去参加这周末的舞会，不过W说已经填了问卷说没有舞伴了，估计也是想分配一个别的院系的小哥哥吧，H也只好等着到时候分配一个了，希望到时候能玩得开心。 下午H终于又去健身房复健了，今日练了下背，感觉现在状态确实掉得有点多，现在做引体都很吃力了，体力也有所下降，以后要多做点有氧先恢复状态了，然后要把力量也提上去，争取之后的什么体育活动里能够发挥点作用。 下午H把西装和之前Q送的很贵的毛衣拿去洗了，西装是为了到时候参加舞会的时候用，毛衣是因为好久没洗了，而且裂了个口子，这也是之前一直没再拿出来穿的原因，等补好洗好之后就可以继续穿了。","link":"/2022/10/25/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day63/"},{"title":"H在清华读硕的日子 day64","text":"2022.10.26 星期三 晴 组会、舞会舞伴、独生子女财产继承——法律vs亲情 早上开组会了，只能说气氛有点微妙，因为J学长和Y老师就某一件事情的工作量产生了不一致的估计，导致大家都认为对方不太正确，并且后来还讨论了Q学长接下来的科研课题，对于这个课题的选择也是持不同的意见，学生们当然是想遵循自己的想法做做科研，但是Y老师的想法就比较多了，要有科研价值、不能和现有主流工作以及别的老师的工作撞车、工作要能落地等等，总之今天的气氛有点微妙，不过也没办法，各有各的想法与难处，还是曾经想的那个点，怎么样在这种制约中找到平衡点，是至关重要的，自由是带着镣铐在跳舞，我们是，他们也是。 晚上H匹配到一个舞伴C了，加了好友，是水利系的一位同学，不太熟悉，不过认识认识也是可以的，到时候表现得大方一点即可。 下午H看《看天下》看到了一篇文章讲述的是独生子女财产继承中的法律与亲情问题，大致是讲述独生子女在父母离世后，如何继承与处理家庭财产的问题，其中牵扯到的最大的问题就是法律与亲情的问题。计划生育是中国历史上一项非常特别的政策，是让人们生育理念发生重大转变的一项政策，也是让人们家庭观念发生重大转变的一项政策。传统的观念中，重男轻女的成分极高，所以家庭都会生很多个孩子，一方面是因为生娃可以当作劳动力，但也有很多例子是生娃就是为了能得到一个男孩。传统的观念中，女孩就是家里的外人，因为迟早会嫁出去的，可能就不会来给自己养老，正是因为这一种思想，很多独生子女如果是女孩，可能就会得不到上上一辈人的特别热烈的关怀（当然自己的亲生父母肯定是关心自己的），因此对于父母离世的财产，上上一辈人也认为应该是属于他们的而不是该女孩的。在现代，这是一种十分有偏的、封建的思想，在如今这个崇尚男女平等的时代，不应该简单地以性别来评判人，大家的身体里都流淌着同样的血液、遗传着同样的基因，如何将女孩看作是家里的外人呢？这是其中一个关于上上一辈人的点。还有关于上一辈人的点，许多独生子女在父母离世后，父母的兄弟姐妹也会渴望分一杯羹，获取他们的遗产，说实话，如果确实有困难，那资助是应当的，但如果另有企图只是顾着钱而来，那未免是过于破坏亲情的行为了。我们国家高速城镇化带来了一个很大的问题，亲人间基本都不居住在一起了，不像过去，亲情似乎得往前追溯很多层才能找到，就像现在很多人回到家乡可能连长辈都不一定认得全。在这种情况下，亲情势必会发生一定的变化，至亲的集合缩小了，从一个“大家”逐渐变成了“小家”。H认为，亲情是一个相互的概念，你曾经给予我情感，我才会对你产生情感，这与友情、爱情等其实是相同的，族系只是一个道德上的约束，并不一定能令人信服。总之，H认为，现在的社会关系已经悄然发生了很多改变，身为独生子女的大多数，并不一定要受到传统观念的制约，该是谁的就是谁的，帮助你是情分，不帮你也没有违背我的本分，亲情是相互的，你对我好，我才会对你好，“天下没有免费的午餐”，不懂得给予的人也是不配拥有他人的给予的。","link":"/2022/10/26/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day64/"},{"title":"H在清华读硕的日子 day65","text":"2022.10.27 星期四 阴 学习、rebuttal、研会开会筹备博论、“一二九”合唱排练 昨天看《看天下》的时候看到了一段非常好的话，现摘抄如下： 平时则放荡治游，考试则熟读讲义，不问学问之有无，惟争分数之多寡；试验既终，书籍束之高阁，毫不过问，敷衍三四年，潦草塞责，文凭到手，即可借此活动于社会，岂非与求学初衷大相背驰乎？ 这句话出自蔡元培先生在1917年在北京大学发表的就职演讲中，难以想象，当初蔡元培先生提到的教训，在如今仍然适用，H希望自己从今往后能够遵循内心的想法而学，学习真正有用的知识，应用到真正的应用中，做有意义的事。 下午去研会开会准备筹备院系的博士生论坛了，事情很多，关系很复杂，需要大家齐心协力，H也是真正了解到了筹办一个大型活动是多么一件不容易的事，希望可以和大家一起做好吧，做好自己的工作，为整体出一份力。 晚上J学长那边的论文rebuttal赶了两个工作，一直忙到了九点半左右，希望rebuttal能有个好结果，让H“混”一篇论文哈哈。 之后就去参加“一二九”合唱排练了，本来还纠结去不去的，因为H的深度学习作业还没做完，不过想想还是去了，一来时间也晚了，再学精力也不是特别旺盛，二来，确实值得去享受一下音乐，出了校园，恐怕是真的再没有这种机会了，还有当然就是不能错过现场的很多消息，所以尽量还是全勤参与吧。 顺便今天的排练效果甚至有点不错，让H有点不敢相信，开始期待最后的效果了。","link":"/2022/10/27/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day65/"},{"title":"H在清华读硕的日子 day66","text":"2022.10.28 星期五 阴 舞培、组会、J学长生日聚餐 中午H去参加了舞培，学了学交际舞，也算是另一种艺术的表现形式吧，也见到了自己的舞伴C，神奇的是算是匹配到了一个身高还比较适合的，这概率也是可以的。学了交际舞之后，H觉得艺术真的是件让人享受的事情，尤其是这种有协作的艺术，重奏、交响、合唱，到今天这个跳舞，充满了一种和谐的美感，让人非常惬意。 下午开组会前进行了之前那篇论文的rebuttal，Y老师提了很多意见与建议，后面看看怎么帮J学长搞完吧。 晚上J学长生日请客！去了至澜院聚餐，祝J学长生日快乐，论文乱发！","link":"/2022/10/28/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day66/"},{"title":"H在清华读硕的日子 day67","text":"2022.10.29 星期六 阴 新生舞会 今天最兴奋的事情当属新生舞会了，什么作业、排练都暂时抛掷脑后了，剩下的是尽情地跳跃、快乐地玩耍，交友，非常开心与兴奋的一个晚上，希望以后能有多点类似的活动呢。","link":"/2022/10/29/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day67/"},{"title":"H在清华读硕的日子 day69","text":"2022.10.31 星期一 阴 深度学习作业收工、应用密码学 今天终于将深度学习作业收工了，最终经过数据增强的模型效果还不错，但是其他的效果一般，希望助教能够施舍多一点分数吧，不然这门课可真是麻烦了。 晚上上了应用密码学，说实话上完这半个学期的课H觉得非常的畅快，感觉学习到了很多有逻辑性的知识，B老师讲得非常有条理，同时其课堂风格也能够让同学们都很专注地聆听，因此在最后讲到大名鼎鼎的RSA算法的时候，H听了都觉得有一种水到渠成的感觉，希望能够把期中大作业实现得完美吧。","link":"/2022/10/31/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day69/"},{"title":"H在清华读硕的日子 day68","text":"2022.10.30 星期天 阴 深度学习作业、跑步、乐团排练 今天仍然继续在赶深度学习的作业，得益于实验室主机的GPU，实验暂时还算顺利，希望明天能搞定，不过到ddl搞不定也得搞定了。感觉深度学习还是学的不扎实，反向传播这种精髓还没学到位，希望之后能努努力吧。 下午去跑步复健了，因为报名了周二的下午四点半跑步活动，要5min配速跑3km呢，还好还有几个同伴，到时候还能接力，今天以4.50的配速跑了两个800感觉人都要没了。 晚上去乐团排练了，今天仍然是《人民胜利》专场，H已经完全跟得上节奏了，也算是能够融入到音乐里边了，享受音乐，下周就要比赛录像了，再抓紧练练吧。","link":"/2022/10/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day68/"},{"title":"H在清华读硕的日子 day70","text":"2022.11.01 星期一 晴 “下午四点半”跑步、男德 下午H去参加“四点半”跑步活动了，一共找了五个班里的同学一起参加，分别是W Q Y X，五点二十分左右大家就在紫操集合完毕了，然后就开跑，本来要求的是以5分配速跑3km，大家（男生）一致认为太难了，就接力了两圈，H和Y组成了接力队伍，Y跑了800m，H跑了剩下的2200m，还好最后也算是顺利达到5min配速，中间在交接的时候还被管理体锻的老师认为是本科生在作弊阳光长跑，不过还好也不是也没深究了。W比较厉害，自己跑完了3km，因为女生要求是6min的配速，就没一起跑，W还是谦虚了，之前还说6min配速很难，结果整个队伍跑得最厉害的就是她了。好久没有这样跑步了，跑完之后非但没有感觉很疲惫，反倒是有一种非常舒畅的感觉，可能也是获得了一次难得的释放自己的机会吧。以后H要多多锻炼，找回当初的感觉，提升体力，提升学习与工作效率，自律是为了更好的享受！ 今天去跑步之前在校园里随手拍了些秋景，学校的树木叶子都变得金黄，非常的好看。 今天H看了《看天下》，今天看的是关于“男德”的部分，H觉得这一部分成为热点，其实是一件好事，说明有越来越多的人认识到传统性别观念中的局限性，男生和女生虽然生来有所不同，但是社会地位应当是平等的，性别的平等是整个社会平等和谐的前提，希望未来这方面能够继续有所推进吧。","link":"/2022/10/31/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day70/"},{"title":"H在清华读硕的日子 day72","text":"2022.11.03 星期四 晴 乐团分排、合唱排练 晚上乐团分排，H被首席表扬说拉得不错，H听了心里挺开心的，当然H觉得很大一部分要归功于乐团的那把琴，那把七、八万的琴！共振实在是太好了，感觉手指大概按到那个位置就能够传出很准的声音，拉这种琴实在是太舒服了，等H以后有钱了一定也要买自己的！这样拉琴才是享受音乐啊！ 乐团分排完紧接着就去排“一二九”合唱了，整体排下来的效果感觉还是不错的，虽然说基本上大家还在唱前半段，离真正的上台也只有一个月左右的时间了，希望大家能够齐心协力，排好这个曲子吧，还是那句话，享受音乐！","link":"/2022/11/04/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day72/"},{"title":"H在清华读硕的日子 day73","text":"2022.11.04 星期五 晴 吃螃蟹、历史的温度 今天下午的组会，课题组里之前毕业的X学长带着大闸蟹回来了！没人都吃到了大闸蟹，真爽。吃完大闸蟹，大家还聊了聊关于当老师的一些事情，H听了不禁感慨，当大学老师不容易啊，特别是当听到还存在考核的分数的时候，更觉得不易，当然了，压力有的时候也能够化为动力去推动人们前进，考核的初衷应该还是好的，但是在目前这个人口爆炸、经济形式不好的环境下，难免会让人内卷起来，这恐怕是没有任何一个地方能够避免得了的了，唯有自身变硬，方能屹立于世啊。 今天H看了看《历史的温度》这本书，还挺有意思，这本书不像一般的历史书按照时间的维度来叙述，而是直接挑选了一些历史上的重要人物来进行解析。今天读到了三位著名的人，居里夫人、爱因斯坦与爱迪生。前两位都是著名的物理学家，他们身上有着相似之处，而且历史上都流传着关于他们的绯闻故事，唉，这种娱乐至上的风气牵扯到科学界真是一种悲哀。读了关于爱迪生的故事，H了解到了很多历史的真相，了解了爱迪生是否真的是第一个发明了电灯泡，了解了爱迪生是否真的一生中有1000多项发明等等，不得不说，爱迪生是一位头脑比较精明的商人，其在将科学研究变现的这条路子上走的很宽敞，其实这在今天看来更是如此。尤记得G老师常说的一句话，大致意思是将研究的价值需要以变现的能力来衡量，对于大部分的实用性的科学来说确实如此，只有真正能够解决问题，才能为社会所用，为人们所肯定，也才能算是出彩的工作。不过这其实也有局限性，一些基础的学科比如数学、物理学，研究者们能做的可能有限，但是放之整个发展历史可能是非常重要的一个环节，他们也同样是十分重要的。","link":"/2022/11/04/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day73/"},{"title":"H在清华读硕的日子 day71","text":"2022.11.02 星期三 晴 组会、乒乓球 今天早上开组会了，继续是谈论勒索软件防护相关的话题，Y老师一直在说有很多东西可以做，但其实粗略想想大部分都有很多人做过了，所以接下来要往哪儿走就继续调研继续看吧，最近的开发是做的挺累的。 晚上继续和Y去Fit楼打乒乓球了，今天打得很爽，打了一个多小时，H和Y都可以拉挺多拍了，而且H买的球网也很好用，以后继续多打打！","link":"/2022/11/02/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day71/"},{"title":"H在清华读硕的日子 day75","text":"2022.11.06 星期天 晴 打篮球，读论文 今天早上和实验室的学长们组了王者荣耀的队伍，下周五可以去玩啦。 下午和课题组去打篮球了，Y老师非常的猛，速度非常快，大家都打得挺开心的。 晚上读了DSL的论文，说实话感觉论文思想非常朴素，但是却非常实用，而且粗读下来感觉实现起来也不是特别困难的事儿，看来科研就是这样，要发现真正的痛点，并且给出实用的解决方案，就能够出彩了。 这两天还发生了一件比较大的事儿吧，有位数学家张益唐在解决什么朗道西格尔定理上取得了一些突破性的进展，据说是15年磨一剑最终写就了111页的论文来验证。H觉得这是一件既伟大又浪漫的事儿，整页的优美排版的公式，引领着我们向着自然科学的真理进发，H其实也希望能够成为这样的人，尽力去做吧，总有一天会成功的！","link":"/2022/11/06/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day75/"},{"title":"H在清华读硕的日子 day74","text":"2022.11.05 星期六 晴 健身、乐团比赛录像、“一二九”合唱 早上H去实验室赶了一会作业后，就去健身房练了会，因为下午到晚上都是满的活动没空去练了。早上去健身房看到了很多身材很好的小姐姐，都是很有训练痕迹看起来很厉害的，没想到都聚集在这个时间段去呀，以前都没怎么看到过。今天H练了胸，前段时间因为太忙所以都没怎么去练，要开始复健了，时间没有那么多啦，要抓紧练壮练健康，迎接之后的体育活动！ 下午去参加了乐团的《人民万岁》的录像，第一次去新清那边演出，刚上来仍然是遇到在大场地演出容易遇到的听不到别的声部的问题，不过还好H也是有四年乐团经验的人了，所以还是能够及时调整过来，看指挥，看对面的弓法来判断节奏等。晚上录像的时候遇到了很坑爹的事情，就是琴的肩托一直卡不稳，老是掉，最后一次录像前之前松了，H只得放在腿上进行演奏，这一幕仿佛回到了曾经在ss乐团第一次演出的场景，当时在星海演出也是肩托掉落，真是没想到这也能情景再现。 晚上去参加了一二九合唱的排练，今天终于是往后排了很多了，效果嘛应该也不错，还是希望到时候能够有完美的展演吧。","link":"/2022/11/06/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day74/"},{"title":"H在清华读硕的日子 day76","text":"2022.11.07 星期一 晴 刘翔、可视化定题、健身跑步 今天早上H看了《历史的温度》中关于刘翔的描写，读下来，有一种为英雄落泪的感觉，刘翔作为一名运动员，已经倾尽所有，为国争光，为人类创造运动奇迹。然而社会的舆论却总是有失偏颇，让真正的英雄承受了太多，希望社会能够更加温和一点地对待我们的英雄吧。 下午H和可视化的队友们讨论题目，最终定下来准备做唐朝诗人的一些生平故事的可视化展示，不禁又回想起高中被语文支配的恐惧，不过说实话书到用时方恨少，如果当时能够更加认真的学习，现在做起来会不会更加得得心应手呢。 晚上去了健身房复健，今天练了肩，然后又去跑了会儿步，希望能够赶紧把状态恢复好吧，继续应对接下来的挑战！","link":"/2022/11/07/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day76/"},{"title":"H在清华读硕的日子 day77","text":"2022.11.08 星期二 晴 Q生日、蔡锷故事阅读、月全食 今天是Q生日，为她送了祝福，也给她买了一个小礼物，一个小乔的钥匙扣，因为上面有＂XIAOQIAO“的标志，所以觉得还挺合适的。 今天阅读了下蔡锷的故事，这位名人是民国第一个能够接受了国葬的伟人，原因是”反袁“以及为国防建设做出了很多贡献。他着实是一位能够看清局势并且善于自我调整并把握机会的人，值得我们学习。 今天出现了月全食，景色非常独特，不过H的手机比较差劲拍不出来，盗几张图放在这里吧。","link":"/2022/11/08/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day77/"},{"title":"H在清华读硕的日子 day78","text":"2022.11.09 星期三 晴 busy、民国英雄将军 最近真是busy呀，这两天既要忙组里的科研工作，同时又还有一大堆作业，希望能够赶紧活过这个月吧，不过有一说一，还算是非常充实，而且做的东西也大都还是有意义的，所以，加油吧，要想有所得，必得经历一些磨难的。 今天上新中特的时候D老师给我们讲了近代中国的一些故事，正好H在阅读《历史的温度》的时候也正好读到了一些关于那个时候的将军英雄人物的故事，今天看了杨靖宇和蒋百里的故事，其中杨靖宇是东北抗联的将军，非常伟大的一位爱国斗士，为民族拼到了最后一刻，奈何周边竟有这么多人背叛导致机密泄露，恶有恶报，这些叛国贼在新中国成立后都受到了应有的惩罚——枪毙。我们国家区别于其他国家的一个很重要的点在于我们国家是个有着十足底蕴的国家，几千年构建起来的精神文化不会被外来文化所侵蚀，这是我们能够屹立于世界之林并且能够有底气成为一个强国的原因。生长于当今这个时代，虽不比当时那个年代直接面临枪林弹雨，但是无形的竞争依然激烈，我们还是要怀揣当年那些伟大的斗士们的精神，努力让我们的国家再上一层楼。","link":"/2022/11/09/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day78/"},{"title":"H在清华读硕的日子 day79","text":"2022.11.10 星期四 阴 南大H老师事件、自动机复习、“一二九”合唱排练 最近听说了H老师的事件，只能说非常离奇，一个学生举报说老师有很多违背师德的事情，甚至致女学生堕胎，消息甚至传遍了南大许多学生的邮箱，一时间H老师被推上风口浪尖，但是过了几天事情又发生了反转，学校发出公告说是那个学生患有精神问题，所以臆造了H老师的很多不良事迹。唉，现在的世界可真是太魔幻了，什么样的事情都有可能发生，网络上流传的东西也不知道是真是假，更可怕的是，舆论的力量实在是太可怕了，H原本是不认识H老师的，但经过这样一波事情过后，对H老师自然就留下了先入为主的不好的印象了，尽管后面有辟谣。舆论要破坏一个人的名声简直太容易了，但是要恢复一个人的名声可谓是难上加难，道理也很容易理解，其实跟“要证明一个东西有很容易，但是要证明一个东西无很难”，学生编造的新闻传播开来，很容易就让人认为H老师的不良行为是有，但是辟谣过后，要怎么证明H老师的不良行为是“无”呢，这也太难了，除非真的很多人站出来声援他，但那样对这位老师本身的要求也很高了，要想到那样德高望重的地位，也非一件易事。H希望以后的互联网能够多一点真实，少一点虚伪吧，除此之外，更需要的人社会中的每个人拥有独立的思考能力，不要轻易被舆论带偏，人言可畏，只有保持自己的一份清醒的理智的头脑，才能看清这个世界，同时，H也希望每个人都能拥有更加强大的心态，千万不要因为舆论的打击而被击溃了心态，毕竟互联网只是个虚拟的世界，好好地活在现实中才是最重要的。 下午到晚上一直在复习自动机，明天有一次独立作业，希望能做好吧。同时也趁着这次机会回顾了下上半学期学的内容，H觉得老师讲得很好，课程安排的很有条理，确实能够学到很多东西，而且没有太多成绩上的顾虑，H觉得这才是大学应该有的样子。 晚上参加了“一二九”合唱排练，感觉离真正能够演出还有一段距离呀，希望之后继续好好排好吧，加油呈现一个比较好的效果。","link":"/2022/11/12/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day79/"},{"title":"H在清华读硕的日子 day80","text":"2022.11.11 星期五 雨 自动机小测、”二十大”学习报告、男生节礼物、王者比赛 早上自动机小测了，有一道题没做出来，但是后来想想是自己想得太复杂了，把简单的问题复杂化了导致没写出来，唉也无所谓吧，毕竟学到真正的知识与本领才是最重要的。 下午上了党课，是关于“二十大”学习报告的，请了学校的博士生讲师团的N学姐来为我们做报告，讲的挺好的，和一直在上的新中特的老师讲得内容也有很多重合之处，讲完之后H感触最深的一个点是关于我们是否输出我们的价值这一点。前端时间H在看《半月谈》杂志的时候曾经看到过，美国是一个以价值输出为外交导向的国家，即在外交过程中将自己的价值观输出给别的国家，当别的国家拒绝接受的时候，也会采取很多极端的手段迫使他国接受，例如舆论战，甚至是直接培养一批“美式精英“再将他们输送到他国的领导阶层中。相比于美国，我们国家的做法就和谐很多了，主体上是求同存异，尊重差异化以及别人的文化。但是H认为我们国家还少了一点，就是文化输出，虽然我们肯定不能走西方国家那种强制型价值观输出的道路，但是我们还是要学习别人的文化输出，因为文化会潜移默化地影响人们的价值观，如果西方国家的文化已经渗透进了我们的社会，届时这种影响将比强制型的价值观输出还要可怕，因为这种文化的影响几乎是不可逆的，一旦形成，短期内难以改变。所以H认为我们国家也一定要建立起强大的文化自信，我们的文化无论是从时间的跨度还是从内涵的深度，其实都是要比西方国家要更好的，我们这一代人一定要建立起强大的文化自信，我们看到的是过去五千年的历史与文化，而他们看到的不过是一两千的年的历史，我们有足够的内涵可以胜过他们。但是拥有文化自信是远远不够的，还要每个人行动起来，将无形的文化寄托于有形的载体中，例如文字、例如图画、例如电影等等，传播出去，不仅让国家内的自己人理解并认同，还要让其他国家的人理解并认同，这是十分重要的。 今天下午收到了实验室另外两位女同学Y和W送的男生节礼物，真的是太贴心了！明年她们的生日和女生节的礼物都别忘记了要还的呀！ 晚上去参加了学院组织的王者荣耀比赛，1胜3负对于我们这些平常也不怎么玩的玩家来说也不错啦，重在参与，确实有很多人很厉害，佩服！当然啦，我们的队友也是很不戳的。","link":"/2022/11/12/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day80/"},{"title":"H在清华读硕的日子 day81","text":"2022.11.12 星期六 晴 秋高气爽、赶实验、“一二九”合唱排练、疫情政策转变、夜谈未来工作 连续下了一段时间雨，今天终于天气放晴了，树上金黄的叶子都被打掉了，有一点秋风萧瑟的感觉，不过天很蓝，更多的给人一种秋高气爽的快感，让人神清气爽。 今天白天一直在赶论文的实验，还处于搭建一个自动化工具的阶段，要抓紧啦，这样后面才能不断地跑出更多的实验数据来做更加完善的分析呢。 晚上去参加了“一二九”合唱排练，今天是分声部排练，说实话感觉效果还可以呢，感觉一早就应该先分声部再合起来练呀，不过离比赛不到一个月了，继续希望能够排好吧，enjoy music！ 今天读报纸的时候看到国家继续对疫情防控的政策做出了改变，取消了中风险区，只保留高低风险区，同时也取消了次密接的隔离政策，是个好消息，说明国家的政策仍然是与时俱进的，希望上面的政策能够有效地传递下去吧，上面虽然给了政策，但更重要的是下面的人的执行，只有真正落实到执行政策的地方，才能真正改善人们对于疫情防控的态度。 晚上和舍友Y和Y聊了聊他们实验室的大哥们的工资情况，都是市场上的超级顶薪，惹得大家都十分羡慕，anyway，大家一起努力吧，虽然说金钱可以在一定程度上衡量一个人的工作能力，但其实最重要的是人要能够享受自己的生活，到了我们这个层次，谁还会缺钱呢？希望H在以后还能做个有高远追求的人，不要做个盲目追求金钱的人，多追求一点世界的真理，多追求一点美的享受，多追求一点浪漫，对周围人的多一点爱，即可。","link":"/2022/11/13/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day81/"},{"title":"H在清华读硕的日子 day82","text":"2022.11.13 星期日 晴 降温、头大的虚拟机自动化脚本、RSA设计、共产党宣言第一章阅读 今天北京大降温了，真是一场秋雨一场寒呀，是以前很少有的体验，要多注意穿衣服了。 因为昨晚聊得晚了点，今天也起的晚了点，迷迷糊糊地到实验室就开始了虚拟机自动化脚本的构建，原本是想一个上午做完了，结果折腾折腾弄了一整天，而且还做的很头大，因为试了好几个版本的win10都没能把之前J学长的工具跑起来，而每次尝试都要等好久的安装过程，简直是太头疼了，感觉以后得弄好很多个版本的虚拟机的备份，以便以后实验有需要的时候就能拿来用呀，暂定就先把its上所有windows的版本和所有ubuntu，centos的版本拿来制作好虚拟机吧，要学会为未来的研究铺垫好道路！不过经过这个工作之后，H也学会了一定要耐心地尝试，万事不可心急，否则可能会乱上加乱。 除了这个论文的工作之外，今天还看了RSA和《共产党宣言》的第一章，RSA主要上网搜了下别人的做法，了解了大概要实现些什么东西，《共产党宣言》的第一章讲述了资产阶级和无产阶级，从中揭示了一些资产阶级的固有矛盾，谈到了无产阶级的重要性，以及如何解决资本主义带来的固有的社会矛盾。","link":"/2022/11/13/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day82/"},{"title":"H在清华读硕的日子 day84","text":"2022.11.15 星期二 晴 赶RSA、DSL汇报 今天还在赶RSA啊，大数运算实在是太慢了，忍不了了！ 晚上DSL汇报课，感觉大家都很厉害，虽然听不懂，但是假装收获满满。","link":"/2022/11/15/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day84/"},{"title":"H在清华读硕的日子 day83","text":"2022.11.14 星期一 晴 赶作业 今天又是在赶一天的作业，太累了。 晚上密码学一开始的百万富翁问题忘了看，结果被B老师点到，感觉B老师真的有特异功能吧，怎么每次没复习就被点呢。","link":"/2022/11/15/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day83/"},{"title":"H在清华读硕的日子 day85","text":"","link":"/2022/11/16/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day85/"},{"title":"H在清华读硕的日子 day86","text":"2022.11.17 星期四 晴 核酸检测志愿者、“一二九”合唱排练 今天下午去做核酸检测志愿者了，这次不需要学生参与扫码的工作，只需要在入口处维持秩序，提醒没带口罩的人戴好口罩就行，然而还是很多人不戴，这也没有办法了，自己的安全只能交由自己来管理。本来是挺无聊枯燥的工作，幸亏这次实验室的J学长也一起参与了这次活动，H和J几乎聊了一下午，从四点多聊到七点多，先是聊了下最近在做的RSA，中间突然想到一个可以优化的点，真是多亏J学长的指点，不过还没尝试，希望明天可以给H的程序的效率带来质的提升。除了作业之外，还聊了一下课程，聊了实验室的故事，聊了组里未来毕业后能去哪儿，H听了这么多感觉挺开心的，很庆幸自己来到了一个不错的组，也对未来充满了希望吧。这次志愿活动算是过得很快活啦。 晚上去了“一二九”排练，今天排练开始前Q指挥讲了讲乐理、讲了讲发声方面的技巧与讲究，还带大家唱了《夜空中最亮的星》和《演员》，挺不错的。今天的排练效果也还行，音准已经有个七七八八了，但是感觉节奏和一些细节还没做得很好，希望在剩下的不到半个月的时间里面大家能完善完善吧。","link":"/2022/11/17/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day86/"},{"title":"H在清华读硕的日子 day87","text":"2022.11.18 星期五 晴 英语pre、深度学习大作业讨论 今天早上H做了英语课的pre啦，这样这学期英语课的压力也算是减轻了不少，算上领域特定语言设计，有两门课差不多就没什么任务了，接下来就是要把几门课的大作业给搞搞好这学期就算是能顺利度过啦。 晚上H去了深度学习答疑，感觉助教讲的特别好，H听完了之后觉得自己又行了，反向传播不过如此！一定要学会它！然后还和组员讨论了下大作业的选题，F同学的选题挺有新意的，就是不知道能不能做出来，希望能做出来吧，加油！","link":"/2022/11/18/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day87/"},{"title":"H在清华读硕的日子 day88","text":"2022.11.20 星期六 晴 补课、犹豫退密码学、vis课开题报告、东配楼后小树林取快递 今天H犹豫要不要退密码学，最近任务实在是太多了，而且这次的RSA做的也不理想，不过想想也已经挺了这么久了，不如再坚持一个多月吧，马上就结束了，下学期就轻松了。 今天vis课开题报告，老师和助教建议我们把工作量放低，老师真是太好了，还为我们别的课程做考量。 晚上尝试去了东配楼后面的小树林取快递，结果发现里面乌漆嘛黑，差点被吓死，没拿到快递就赶忙跑出来了。","link":"/2022/11/20/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day88/"},{"title":"H在清华读硕的日子 day89","text":"2022.11.20 星期天 晴 《共产党宣言》读书报告写完、良师益友交流会、“人才”之悲剧——人之过or才之过 今天H把新中特的读书报告写完了，主要是谈了《共产党宣言》中所提到的一些共产主义的理念与当下社会中现存的人性中的缺点的冲突，简答描述了一下我们在实现共产主义的路上可能面临的种种困难。 下午参加了F老师的良师益友交流会，F老师非常好，讲了很多做研究上的方法论。不过H觉得从入学以来已经听了太多这样的鸡汤了，对现在的H似乎已经不太受用，H现在更需要的是接触一些实在的知识，先做好一只“青蛙”，再想着如何成为一只“飞鸟”吧。 “人才”之悲剧——人之过or才之过，读“戴笠”故事后感。今天H读了历史的温度中关于戴笠的描写，戴笠是国民党内一个十分厉害的特工，为国民党建立了一套十分强大的情报系统，在抗日以及对抗共产党的斗争中起到了十分重要的作用。然而，他的人生终止得略显意外，是在一个雨天由于自己的专机失事而身亡，真是可惜了。历史上关于他的死亡有很多不同的揣测，有许多观点谈到是由于他位高而遭遇不测，毕竟当时他已经处在“一人之下，万人之上”的地位，甚至能够单独联系美国取得帮助。书中描写到，历史上像这样的人才难以善终的不计其数，这究竟是人之过还是才之过呢，人类社会真的是太复杂了，说实话，H认为，一个人才，有时候真的很难在上面有约束的情况下发挥自己最大的能力，但是我们的社会却又不是那么得自由得能够让人才直接上位的，因此，人才也总是会因为才之过而难以善终吧。所幸，H还未拥有如此的能耐，尚且不用考虑这么复杂的事情。 对了今天清华又检测出有人阳性，且这个人还和学生有接触，封校的力度再次增加，什么时候疫情才能结束啊。","link":"/2022/11/20/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day89/"},{"title":"H在清华读硕的日子 day90","text":"2022.11.21 星期一 晴 赶实验 上个周末因为赶作业加上太累了所以J学长论文的实验还没干完，今天就一直在赶，弄得也挺累的，等这篇论文过完了就要好好休息下。","link":"/2022/11/22/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day90/"},{"title":"H在清华读硕的日子 day92","text":"2022.11.23 星期三 晴 乒乓球、德国vs.日本世界杯 下午去打乒乓球了，今天是和W、J、还有Y一起去打的，W和J好厉害，一手旋球打得摸不着头脑，看来是时候要学一点物理学来弄懂旋球的原理了，不然打得实在是有点懵逼。 晚上看了看世界杯，今天有一场德国ｖｓ．日本的小组赛，日本在下半场力挽狂澜，上半场０：１的情况下反超最终２：１拿下，看得真是有点小激动，足球是圆的，真是什么都有可能发生，不禁让H会想起小时候看球的时候那种心情，只可惜现在已经长大到２０多岁了，以往的梦想不再，曾经当足球员的梦想已经遥遥远去，在当下的道路走出精彩吧！","link":"/2022/11/23/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day92/"},{"title":"H在清华读硕的日子 day91","text":"2022.11.22 星期二 晴 《神雕侠侣》、趣味羽毛球赛报名、赶实验、准备Quant面试 这两天H开始看金庸的《神雕侠侣》，刚看了前面的两章，感觉写的确实不错，H决定找回一点童年缺失的东西，看看武侠小说，看看能不能把自己磨练出江湖侠客的心性。 今天和一些同学报名了周六的趣味羽毛球比赛，中间还发生了一些神奇的巧合，不过也算是把名先报上了，希望周六能够顺利线下玩玩吧。 今天终于算是把一些实验赶完了，看看明天组会之后还有没有别的活吧。 明天要帮Q面试，加油，今天刷了些概率论感觉都挺有意思的，还在犹豫以后要不要也走这一路。","link":"/2022/11/22/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day91/"},{"title":"H在清华读硕的日子 day93","text":"2022.11.24 星期四 晴 实验室王者 今天白天在赶作业，晚上在实验室和W学长及H学长开黑打王者，原本是想着赢一把就下车，结果上来连跪三把，真是悲催啊，看来还需多多磨练技术，好在第四把总算赢了，还是靠着W学长的李信偷家获胜。","link":"/2022/11/28/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day93/"},{"title":"H在清华读硕的日子 day97","text":"2022.11.28 星期一 晴 舍友都回家了、研会年终奖、密码学布置大作业 今天一早舍友Y也回家了，这下宿舍只剩下H一个人了，不过也还好，独享一个大house还是很舒服的，就是希望后面不要发生太多封控的倒霉事吧。 今天去帮研会那边搬了很多礼品，本来是准备给博论用的，不过博论该线上了，很多礼品也就变成了研会的年终奖发给了大家，拿到了两本书，《置身事内》和《蛤蟆先生去看心理医生》，还有两个笔记本和文件袋，书挺不错的，笔记本也可以假期拿回去送给亲戚们。 晚上布置密码学大作业了，抱紧Q的大腿。","link":"/2022/11/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day97/"},{"title":"H在清华读硕的日子 day94","text":"2022.11.25 星期五 晴 练羽毛球、赶论文实验 明天就是“双剑合璧”羽毛球趣味赛了，今天赶紧去练了练，舍友Y因为要修bug所以来不了了，组里的R同学好像身体不舒服也没来，所以只来了H，W，X和H，今天算是复健吧，打得有点吃力，感觉移动的脚步都有点跟不上，打完之后更是感到腰酸背痛，要多进行不同的锻炼呀，不然身上这些关节都要废啦。 晚上又继续赶论文实验了，这次遇到了edge很坑爹的地方，跑完一轮居然关不掉，导致自动化的脚本没法大规模地跑，也就没办法达到1000条的要求，还需要继续努力改啊。","link":"/2022/11/28/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day94/"},{"title":"H在清华读硕的日子 day95","text":"2022.11.26 星期六 晴 “双剑合璧”趣味羽毛球赛 今天打了羽毛球赛，和J学长一起打了两场男双，打比赛的感觉还不错，挺有意思的，也算是找到了一些球友，以后可以一起去玩啦。 打完球赛又继续苦哈哈地赶作业了，希望赶紧搞完吧。","link":"/2022/11/29/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day95/"},{"title":"H在清华读硕的日子 day96","text":"2022.11.27 星期日 寒 赶实验、赶作业 今天算是差不多把J学长的实验做完了，剩下还有一个小实验再跑一跑，表示我们的诚意。 顺便还继续深度学习大作业，真是短短几天创造奇迹的大工程。","link":"/2022/11/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day96/"},{"title":"H在清华读硕的日子 day98","text":"2022.11.29 星期二 晴 深度学习听的一脸懵 早上听深度学习可谓是一脸懵，越来越听不懂了，好在是也没几节课了，开学时的豪情壮志到现在似乎消减了不少，希望后面还能振作起来把这个课继续尽量学到知识吧。 这学期学校非常照顾大家，在今天开通了退课，不仅能退课，还能申请成绩记为P/F，就是只记录通过或者不通过，但是成绩不算入GPA，T大真是处处充满了博弈论的味道，H也要好好斟酌一下了，不过嘛，成绩在现在看来似乎不是特别重要，重要的是学到知识，过得快乐，多发论文！","link":"/2022/11/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day98/"},{"title":"H在清华读硕的日子 day99","text":"2022.11.30 星期三 晴 早上封控虚惊一场、广州放开、江泽民去世 不知不觉来到第99天了，也算是赶完了之前几天的日记，没让拖延症到达下一个百天，时间真是过得飞快，还剩30天左右这学期也就过完了，珍惜当下的日子吧，珍惜周围的朋友们，为大家带去快乐，也为自己带来快乐。 早上难得得经历了一次封控，因为宿舍楼内有人10混1检测阳性了，还好的是复检阴性，早上九点左右有人送了早餐的楼里，还是非常感谢这些志愿者们的，中午13点左右就解封了，一切恢复了正常，不过还是让人心里不免慌张起来。 今天还接收到了很多大消息，一是广州解封了，基本上是开摆了，仅剩下一些非常简易的隔离政策，看来国家是已经要慢慢走向下一阶段的防疫了，希望能顺利安稳地渡过吧。二是江泽民去世了，缅怀，两件事情似乎都预示了过去的时代的终结，是啊没有什么是永恒的，我们都要积极地向前看。","link":"/2022/11/30/H%E5%9C%A8%E6%B8%85%E5%8D%8E%E8%AF%BB%E7%A1%95%E7%9A%84%E6%97%A5%E5%AD%90-day99/"}],"tags":[{"name":"diary","slug":"diary","link":"/tags/diary/"}],"categories":[{"name":"diary","slug":"diary","link":"/categories/diary/"}],"pages":[]}